Repository: Kiy4h/TortugadeMexico
Catalog: po/*.po
Languages: hr, sq, uk

source: used as numeric input in mathematic operators
hr: koristi se kao brojčani unos u matematičkim operatorima
sq: e përdorur si dhënie vlerash numerike në operatorë matematikë
uk: використовується як числове вхідне значення у математичних операторах

source: greater than
hr: veći od
sq: më e madhe se
uk: більше, ніж

source: logical greater-than operator
hr: logički veći-od operator
sq: operatori logjik më-e-madhe-se
uk: логічний оператор «більше»

source: less than
hr: manji od
sq: më e vogël se
uk: менше, ніж

source: logical less-than operator
hr: logički manje-od operator
sq: operatori logjik më-e-vogël-se
uk: логічний оператор «менше»

source: equal
hr: jednako
sq: baras me
uk: дорівнює

source: logical equal-to operator
hr: logički jednako-je operator
sq: operatori logjik baras-me
uk: логічний оператор рівності

source: not
hr: ne
uk: ні

source: logical NOT operator
hr: logički NE operator
sq: operatori logjik NOT
uk: логічний оператор НІ

source: and
hr: i
uk: і

source: logical AND operator
hr: logički I operator
sq: operatori logjik AND
uk: логічний оператор І

source: or
hr: ili
uk: або

source: logical OR operator
hr: logički ILI operator
sq: operatori logjik OR
uk: логічний оператор АБО

source: flow
hr: tok programa
sq: rrjedhë
uk: обробка

source: wait
hr: čekaj
sq: pritni
uk: чекай

source: pauses program execution a specified number of seconds
hr: zaustavi izvršavanje programa za specificirani broj sekundi
sq: e ndal përmbushjen e një programi sa numri i dhënë i sekondave
uk: призупиняє виконання програми на вказану кількість секунд

source: forever
hr: zauvijek
sq: përgjithmonë
uk: назавжди

source: loops forever
hr: vječna petlja
sq: kryhet pambarimisht
uk: нескінченний цикл

source: repeat
hr: ponovi
sq: përsërite
uk: повторити

source: loops specified number of times
hr: ponavlja specificirani broj puta
sq: kryhet një numër të caktuar herësh
uk: циклічне виконання вказану кількість разів

source: if
hr: ako
uk: якщо

source: then
hr: onda
uk: тоді

source: if then
hr: ako onda
uk: якщо тоді

source: if-then operator that uses boolean operators from Numbers palette
hr: operator ako-onda; koristi logičke operatore iz palete „Matematički operatori“
sq: operatori if-then që përdor operatorë buleanë nga paleta e Numrave
uk: оператор виконання «якщо-тоді», у якому використовуються булеві оператори з палітри «Числа»

source: else
hr: onda
uk: інакше

source: if then else
hr: ako onda inače
uk: якщо тоді інакше

source: if-then-else operator that uses boolean operators from Numbers palette
hr: operator ako-onda-inače; koristi logičke operatore iz bloka „Matematički operatori“
sq: operatori if-then-else që përdor operatorë buleanë nga paleta e Numrave
uk: оператор виконання «якщо-тоді-інакше», у якому використовуються булеві оператори з палітри «Числа»

source: horizontal space
hr: horizontalni prostor
sq: hapësirë horizontale
uk: горизонтальний інтервал

source: jogs stack right
hr: pomakne stȏg nadesno
uk: зсуває стос праворуч

source: vertical space
hr: vertikalni prostor
sq: hapësirë vertikale
uk: вертикальний інтервал

source: jogs stack down
hr: pomakne stȏg nalijevo
uk: зсуває стос униз

source: stop action
hr: zaustavi akciju
sq: ndale veprimin
uk: припинити дію

source: stops current action
hr: zaustavi trenutačnu akciju
sq: ndal veprimin e tanishëm
uk: припиняє поточну дію

source: Palette of variable blocks
hr: Varijable i potprogrami
sq: Paletë blloqesh ndryshoresh
uk: Палітра блоків змінних

source: blocks
hr: blokovi
sq: blloqe
uk: блоки

source: connects action to toolbar run buttons
hr: povezuje akciju s gumbima za pokretanje, zec/puž, na alatnoj traci
uk: з’єднує дію з кнопками виконання панелі інструментів

source: top of nameable action stack
hr: vrh stȏga s akcijom koja se može imenovati
uk: верх іменованого стосу дій

source: store in box 1
hr: spremi u kutiju 1
sq: depozitoje në kutinë 1
uk: зберегти на панелі 1

source: stores numeric value in Variable 1
hr: sprema brojčanu vrijednost u Varijablu 1
sq: depoziton vlerë numerike te Ndryshorja 1
uk: зберігає числове значення у змінній 1

source: store in box 2
hr: spremi u kutiju 2
sq: depozitoje në kutinë 2
uk: зберегти на панелі 2

source: stores numeric value in Variable 2
hr: sprema brojčanu vrijednost u Varijablu 2
sq: depoziton vlerë numerike te Ndryshorja 2
uk: зберігає числове значення у змінній 2

source: box 1
hr: kutija 1
sq: kutia 1
uk: панель 1

source: Variable 1 (numeric value)
hr: Varijabla 1 (brojčana vrijednost)
sq: Ndryshorja 1 (vlerë numerike)
uk: Змінна 1 (числове значення)

source: box 2
hr: kutija 2
sq: kutia 2
uk: панель 2

source: Variable 2 (numeric value)
hr: Varijabla 2 (brojčana vrijednost)
sq: Ndryshorja 2 (vlerë numerike)
uk: Змінна 2 (числове значення)

source: box
hr: kutija
sq: kuti
uk: панель

source: action 1
hr: akcija 1
sq: veprimi 1
uk: дія 1

source: top of Action 1 stack
hr: vrh stȏga Akcije 1
uk: верх стосу Дія 1

source: action 2
hr: akcija 2
sq: veprimi 2
uk: дія 2

source: top of Action 2 stack
hr: vrh stȏga Akcije 2
uk: верх стосу Дія 2

source: invokes Action 1 stack
hr: pokrene stȏg s Akcijom 1
uk: викликає стос Дія 1

source: invokes Action 2 stack
hr: pokrene stȏg s Akcijom 2
uk: викликає стос Дія 2

source: invokes named action stack and returns value
hr: pokrene stȏg s imenovanom akcijom i vrati njegovu vrijednost
uk: викликає іменований стос дій і повертає значення

source: return
hr: vraćanje
uk: поверни

source: returns a value
hr: vrati vrijednost
sq: përgjigjet me një vlerë
uk: повертає значення

source: permanently deletes items in trash
hr: trajno izbriše smeće
sq: fshin përgjithnjë objektet te hedhurinat
uk: остаточно вилучає записи у смітнику

source: restore all
hr: vrati sve
sq: riktheji krejt
uk: відновити все

source: restore all blocks from trash
hr: vrati sve blokove iz smeća
sq: rikthe prej hedhurinave krejt blloqet
uk: відновлює усі блоки зі смітника

source: clear all
hr: očisti sve
sq: pastroji krejt
uk: спорожнити все

source: move all blocks to trash
hr: sve blokove premjesti u smeće
sq: shpjeri krejt blloqet te hedhurinat
uk: пересуває усі блоки до смітника

source: saves a picture to theJournal
hr: spremi sliku uDnevnik

source: saves turtle graphics as an SVG file in theJournal
hr: sprema kornjačinu grafiku kao SVG datoteku uDnevnik

source: hides thetoolbars
hr: skrije alate

source: Logo
hr: Logotip

source: shade
hr: sjenčanje
sq: hije

source: tab
sq: tasti Tab

source: enter
sq: tasti Enter

source: delete
sq: tasti Delete
