Repository: Kiy4h/TortugadeMexico
Catalog: po/*.po
Languages: hr, sq, uk

source: presentation template: select Journal object (with description)
hr: predložak za prezentaciju: izaberi objekt iz Dnevnika (s opisom)
sq: gjedhe prezantimi: përzgjidhni objekt Ditari (me përshkrim)
uk: шаблон презентації: виберіть об’єкт журналу (із описом)

source: presentation template: select four Journal objects
hr: predložak za prezentaciju: izaberi četiri objekta iz Dnevnika
sq: gjedhe prezantimi: përzgjidhni katër objekte Ditari
uk: шаблон презентації: виберіть чотири об’єкти журналу

source: presentation template: select two Journal objects
hr: predložak za prezentaciju: izaberi dva objekta iz Dnevnika
sq: gjedhe prezantimi: përzgjidhni dy objekte Ditari
uk: шаблон презентації: виберіть два об’єкти журналу

source: left
hr: lijevo ↶
sq: majtas
uk: ліворуч

source: xcor of left of screen
hr: x-koor od lijevog ruba zaslona
sq: koordinata x e të majtës së ekranit
uk: координата за x лівого краю екрана

source: bottom
hr: dno
sq: fund
uk: знизу

source: ycor of bottom of screen
hr: y-koor od dna zaslona
sq: koordinata y e fundit të ekranit
uk: координата y нижньої межі екрана

source: width
hr: širina
sq: gjerësi
uk: ширина

source: the canvas width
hr: širina prozora
sq: gjerësia e kanavacës
uk: ширина полотна

source: right
hr: desno ↷
sq: djathtas
uk: праворуч

source: xcor of right of screen
hr: x-koor od desnog ruba zaslona
sq: koordinata x e të djathtës së ekranit
uk: координата x правої межі екрана

source: ycor of top of screen
hr: y-koor od vrha zaslona
sq: koordinata y e kryes së ekranit
uk: координата y верхньої межі екрана

source: height
hr: visina
sq: lartësi
uk: висота

source: the canvas height
hr: visina prozora
sq: lartësia e kanavacës
uk: висота полотна

source: title x
hr: naslov x
sq: x titulli
uk: x заголовка

source: title y
hr: naslov y
sq: y titulli
uk: y заголовка

source: left x
hr: lijevo: x
sq: x majtas
uk: ліворуч за x

source: top y
hr: vrh: y
sq: y sipër
uk: згори за y

source: right x
hr: desno: x
sq: x djathtas
uk: праворуч за x

source: bottom y
hr: dno: y
sq: y poshtë
uk: знизу за y

source: Palette of user-defined operators
hr: Moji vlastiti blokovi
sq: Paletë operatorësh të përcaktuar nga përdoruesi
uk: Палітра визначених користувачем операторів

source: my blocks
hr: moji blokovi
sq: blloqet e mi
uk: мої блоки

source: brightness
hr: svjetlina
sq: ndriçim
uk: яскравість

source: light level detected by camera
hr: razina svjetline koju osjeća kamera
sq: nivel drite pikasur nga kamera
uk: рівень освітлення, визначений камерою

source: camera output
hr: kamerin izlaz
uk: виведення камери

source: Average RGB color from camera is pushed to the stack
hr: Prosječna RGB boja iz kamere je gurnuta u stȏg
uk: Середній колір RGB з камери дописано до стосу

source: read value from RFID device
hr: pročitaj vrijednost iz RFID uređaja
sq: lexo vlerë prej pajisjeje RFID
uk: прочитати значення із пристрою RFID

source: acceleration
hr: ubrzanje
sq: përshpejtim
uk: прискорення

source: push acceleration in x, y, z to heap
hr: gurne ubrzanje u x, y, z na hrpu
uk: дописати прискорення у форматі x, y, z до купи

source: light level detected by light sensor
hr: razina svjetline koju osjeća svjetlosni senzor
sq: nivel drite pikasur nga ndijues drite
uk: рівень освітленості, визначений датчиком освітлення

source: sound
hr: zvuk
sq: tingull
uk: звук

source: raw microphone input signal
hr: sirovi mikrofonski ulazni signal
sq: sinjal mikrofoni në hyrje, i papërpunuar
uk: необроблений вхідний сигнал мікрофона

source: loudness
hr: glasnoća
sq: volum
uk: гучність

source: microphone input volume
hr: glasnost na ulazu u mikrofon
sq: volum mikrofoni në hyrje
uk: вхідна гучність мікрофона

source: microphone input pitch
hr: visina tona na ulazu u mikrofon
sq: lartësi tingulli mikrofoni në hyrje
uk: вхідний тон мікрофона

source: resistance
hr: otpor
sq: rezistencë
uk: опір

source: microphone input resistance
hr: ulazni otpor mikrofona
sq: rezistencë mikrofoni në hyrje
uk: вхідний опір мікрофона

source: voltage
hr: napon
sq: voltazh
uk: напруга

source: microphone input voltage
hr: napon na ulazu mikrofona
sq: voltazh mikrofoni në hyrje
uk: вхідна напруга мікрофона

source: uturn
hr: obrni
sq: kthesë U
uk: розворот

source: turns the turtle 180 degrees
hr: rotira kornjaču za 180°
sq: e kthen breshkën me 180 gradë
uk: розвертає черепашку на 180 градусів

source: Please install the Speak Activity and try again.
hr: Instaliraj aktivnost „Govori“ i pokušaj ponovno.
sq: Ju lutemi, instaloni Veprimtarinë Flisni dhe riprovoni.
uk: Будь ласка, встановіть модуль «Розмова» і повторіть спробу.

source: Spanish
hr: španjolski
sq: Spanjisht
uk: іспанська

source: English
hr: engleski
sq: Anglisht
uk: англійська

source: Sorry, I can't understand what you are asking about.
hr: Žao mi je, ali ne razumijem tvoje pitanje.
sq: Më ndjeni, s’kuptoj dot çfarë po pyesni.
uk: Вибачте, не можу зрозуміти, про що ви питаєте.

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
hr: Žao mi je, ali nema dovoljno slobodne memorije za moj mozak. Zatvori neku aktivnost i pokušaj ponovno.
sq: Më ndjeni, s’ka kujtesë të lirë që të ngarkohet truri im. Mbyllni veprimtari të tjera dhe provoni edhe një herë.
uk: Вибачте, не вистачає пам’яті, щоб завантажити мої мізки. Закрийте інші програми і повторіть спробу.

source: other
hr: ostalo
sq: tjetër
uk: інше

source: push destination rgb value to heap
hr: gurne odredišnu rgb vrijednost na hrpu
uk: дописати значення rgb цілі до купи

source: stop
sq: ndale
uk: зупинити

source: play
hr: reproduciraj
sq: luaje
uk: відтворити

source: save
hr: spremi
sq: ruaje
uk: зберегти

source: did not output to
hr: nema izlaza na
sq: s’dha përfundim në
uk: не вивів до

source: doesn't like
hr: ne sviđa se
sq: s’e pëlqen
uk: не є

source: as input
hr: kao ulaz
sq: si futje
uk: як вхід

source: I don't know how to
hr: Ne znam kako
sq: S’di si të
uk: Невідомий спосіб

source: usage is
hr: se rabi
sq: përdorimi është
uk: використання

source: No option action:
hr: Nema opcijske akcije:
uk: Дія без параметрів:

source: File not found
hr: Datoteka nije pronađena
sq: S’u gjet kartelë
uk: Файл не знайдено

source: Configuration directory not writable: %s
hr: U konfiguracijski direktorij nije moguće zapisivati: %s
sq: Drejtoria e formësimeve s’është e shkrueshme: %s
uk: Каталог налаштувань непридатний до запису: %s

source: New
hr: Novo
sq: I ri
uk: Створити

source: Show sample projects
hr: Pokaži primjere projekata
sq: Shfaq shembuj projektesh
uk: Показати зразки проектів

source: Save as
hr: Spremi kao
sq: Ruaje si
uk: Зберегти як

source: Export as
hr: Eksport kao
sq: Eksportoje si
uk: Експортувати як

source: image
hr: slika
sq: figurë
uk: зображення

source: image (blocks)
hr: slika (blokovi)
sq: figurë (blloqe)
uk: зображення (блоки)

source: icon
hr: ikona
sq: ikonë
uk: піктограма

source: Quit
hr: Izlaz
sq: Dil
uk: Вийти

source: File
hr: Datoteka
sq: Kartelë
uk: Файл

source: Rescale coordinates
hr: Razmjerna promjena koordinata
sq: Ripërmaso koordinata
uk: Змінити масштаб координатних осей

source: Reset block size
hr: Vrati blokove na početnu veličinu
sq: Ricaktoni madhësi blloku
uk: Відновити розмір блоку

source: Show/hide blocks
hr: Pokaži/skrij blokove
sq: Shfaq/fshih blloqe
uk: Показати або приховати блоки

source: Tools
hr: Alati
sq: Mjete
uk: Інструменти

source: Debug
hr: Debugiranje
sq: Diagnostikojeni
uk: Діагностика

source: Turtle
hr: Kornjača
sq: Breshka
uk: Черепаха

source: Plugins
hr: Plugini
sq: Shtojca
uk: Додатки

source: About...
hr: O programu...
sq: Rreth…
uk: Про програму…

source: You have unsaved work. Would you like to save before quitting?
hr: Nisi spremio svoj rad. Želiš li ga spremiti prije završetka rada?
sq: Keni punë të paruajtur. Do të donit të ruhej përpara se të dilej?
uk: Вашу роботу не збережено. Хочете зберегти її, перш ніж завершити роботу програми?

source: Save project?
hr: Spremiti projekt?
sq: Të ruhet projekti?
uk: Зберегти проект?

source: Plugin %s already installed
hr: Plugin %s je već instaliran
sq: Shtojca %s është tashmë e instaluar
uk: Додаток %s вже встановлено

source: myproject
hr: moj_projekt
sq: projekti-im
uk: проект

source: Please restart %s in order to use the plugin.
hr: Za korištenje plugina treba ponovno pokrenuti %s.
sq: Ju lutemi, bëni rinisjen e %s që të përdoret shtojca.
uk: Будь ласка, перезапустіть %s, щоб скористатися додатком.

source: Please restart %s in order to unload the plugin.
hr: Za uklanjanje plugina treba ponovno pokrenuti %s.
sq: Ju lutemi, riniseni %s që të shkarkohet shtojca nga sistemi.
uk: Будь ласка, перезапустіть %s, щоб вивантажити додаток.

source: displays next palette
hr: prikaže sljedeću paletu
sq: shfaq paletën pasuese
uk: показує наступну палітру

source: changes the orientation of the palette of blocks
hr: mijenja orijentaciju prikaza paleta; vodoravno/okomito
sq: ndryshon orientimin e paletës së blloqeve
uk: змінює орієнтацію палітри блоків

source: trash
hr: smeće
uk: смітник

source: block is not exportable
hr: blok nije moguće eksportirati
sq: blloku s’është i eksportueshëm
uk: блок не є придатним до експортування

source: error while exporting block
hr: dogodila se greška tijekom eksporta bloka
sq: gabim gjatë eksportimit të bllokut
uk: помилка під час спроби експортувати блок

source: error in highlighted block
hr: greška u istaknutom bloku
sq: gabim te blloku i theksuar
uk: помилка у підсвіченому блоці

source: error
hr: greška
sq: gabim
uk: помилка

source: orientation
hr: orijentacija
sq: orientim
uk: орієнтація

source: next
hr: sljedeće
sq: pasuesi
uk: далі

source: shift
hr: pomaknuti
uk: зсув

source: Please hit the Stop Button before making changes to your program
hr: Klikni na Stop gumb da bi mogao izmijeniti program
sq: Ju lutemi, klikoni mbi butonin Ndal përpara se të bëni ndryshime në programin tuaj
uk: Перш ніж вносити зміни до вашої програми, будь ласка, натисніть кнопку «Стоп»

source: action
hr: akcija
sq: veprim
uk: дія

source: my box
hr: moja kutija
sq: kutia ime
uk: моя панель

source: Select blocks to share
hr: Odaberi blokove za objaviti
sq: Përzgjidhni blloqe për ndarje me të tjerët
uk: Виберіть блоки для оприлюднення

source: Really overwrite stack?
hr: Stvarno prebrisati stȏg?
uk: Справді перезаписати стос?

source: Overwrite stack
hr: Prebriši stȏg
uk: Перезаписати стос

source: Really delete stack?
hr: Stvarno izbrisati stȏg?
uk: Справді вилучити стос?

source: empty trash
hr: isprazni smeće
sq: zbraz hedhurinat
uk: спорожнити смітник

source: Do you really want to empty the trash?
hr: Zaista želiš isprazniti smeće?
sq: Doni vërtet të zbrazen hedhurinat?
uk: Ви справді хочете спорожнити смітник?

source: Cannot write data to %s.
hr: Nije moguće pisati u %s.
sq: S’shkruhen dot të dhëna te %s.
uk: Не вдалося записати дані до %s.

source: Please choose a different save directory.
hr: Izaberi neki drugi direktorij za spremanje.
sq: Ju lutemi, përzgjidhni një tjetër drejtori ruajtjeje.
uk: Будь ласка, виберіть інший каталог для зберігання даних.

source: Please choose a different file name.
hr: Izaberi neko drugo ime za datoteku.
sq: Ju lutemi, përzgjidhni një tjetër emër kartele.
uk: Будь ласка, виберіть іншу назву файла.

source: xcor
hr: x-koor
sq: koordinata x
uk: коорд_x

source: ycor
hr: y-koor
sq: koordinata y
uk: коорд_y

source: heading
hr: smjer
sq: krye
uk: заголовок

source: gray
hr: sivo
sq: gri
uk: сірий

source: color
hr: boja
sq: ngjyrë
uk: колір

source: True
hr: Istina
sq: E vërtetë
uk: Так

source: False
hr: Laž
sq: E rreme
uk: Ні

source: %s blocks image
hr: slika bloka %s
uk: Зображення блоків %s

source: invokes named action stack
hr: pokrene stȏg s imenovanom akcijom
uk: викликає іменований стос дій

source: named variable (numeric value)
hr: imenovana varijabla (numerička vrijednost)
sq: ndryshore me emër (vlerë numerike)
uk: іменована змінна (числове значення)

source: store in
hr: spremi u
sq: depozitoje në
uk: зберегти у

source: value
hr: vrijednost
sq: vlerë
uk: значення

source: stores numeric value in named variable
hr: spremi numeričku vrijednost u imenovanu varijablu
sq: depoziton vlerë numerike në ndryshore të emërtuar
uk: зберігає числове значення у іменованій змінній

source: Plugin could not be installed.
hr: Plugin nije moguće instalirati.
sq: Shtojca s’u instalua dot.
uk: Не вдалося встановити додаток.

source: up
sq: tasti Up
uk: вгору

source: down
sq: tasti Down
uk: вниз

source: backspace
sq: tasti Backspace
uk: забій

source: space
sq: tasti Space
uk: пробіл

source: Title
hr: Naslov
sq: Titull
uk: Заголовок

source: banana
sq: banane
uk: банан

source: Load...
hr: Učitavanje...
sq: Ngarkoni…
uk: Завантажити…

source: Save...
hr: Spremanje...
sq: Ruajeni…
uk: Зберегти…

source: Palette of turtle commands
hr: Komande za micanje kornjače
sq: Paletë urdhrash breshke
uk: Палітра команд черепашки

source: moves turtle forward
hr: pomiče kornjaču naprijed
sq: e shpie breshkën përpara
uk: пересовує черепашку вперед

source: back
hr: natrag
sq: mbrapsht
uk: назад

source: moves turtle backward
hr: pomiče kornjaču unatrag
sq: e shpie breshkën mbrapsht
uk: пересуває черепашку назад

source: clean
hr: počisti
sq: pastroje
uk: спорожнити

source: clears the screen and reset the turtle
hr: počisti zaslon i vrati kornjaču na početak
sq: pastron ekranin dhe zeron breshkën
uk: спорожняє екран і відновлює початкову позицію черепашки

source: turns turtle counterclockwise (angle in degrees)
hr: rotira kornjaču lijevo (u smjeru suprotno od kazaljke na satu za kut u stupnjevima)
sq: e kthen breshkën sipas kahut kundërorar (kënd në gradë)
uk: повертає черепашку проти годинникової стрілки (кут у градусах)

source: turns turtle clockwise (angle in degrees)
hr: rotira kornjaču desno (u smjeru kazaljke na satu za kut u stupnjevima)
sq: e kthen breshkën sipas kahut orar (kënd në gradë)
uk: повертає черепашку за годинниковою стрілкою (кут у градусах)

source: arc
hr: luk
sq: hark
uk: дуга

source: angle
hr: kut
sq: kënd
uk: кут

source: radius
hr: radijus
sq: rreze
uk: радіус

source: moves turtle along an arc
hr: pomiče kornjaču po luku
sq: e lëviz breshkën sipas një harku
uk: пересуває черепашку уздовж дуги

source: set xy
hr: zadaj xy
sq: caktoni xy
uk: встановити xy

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
hr: pomakne kornjaču na poziciju (x-koor, y-koor); (0, 0) je centar zaslona.
sq: e lëviz breshkën te pozicioni me koordinata x, y; (0, 0) përfaqëson qendrën e ekranit.
uk: пересуває черепашку у позицію з координатами коорд_x, коорд_y; (0, 0) — центр екрана.

source: set heading
hr: zadaj smjer
sq: caktoni drejtim
uk: встановити напрямок голови

source: sets the heading of the turtle (0 is towards the top of the screen.)
hr: zadaje kornjači smjer kretanja (smjer 0 je prema vrhu zaslona)
sq: cakton drejtimin e breshkës (0 është drejt kreut të ekranit.)
uk: встановлює напрямок голови черепашки (0 відповідає верху екрана)

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
hr: zadrži trenutačnu vrijednost x koordinate kornjače (može se upotrijebiti umjesto bloka ‘broj’)
sq: mban vlerën e tanishme të koordinatës x të pozicionit të breshkës (mund të përdoret në vend të një numri blloku)
uk: зберігає поточне значення координати x черепашки (може бути використано у місці числового блоку)

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
hr: zadrži trenutačnu vrijednost y koordinate kornjače (može se upotrijebiti umjesto bloka ‘broj’)
sq: mban vlerën e tanishme të koordinatës y të pozicionit të breshkës (mund të përdoret në vend të një numri blloku)
uk: зберігає поточне значення координати y черепашки (може бути використано у місці числового блоку)

source: holds current heading value of the turtle (can be used in place of a number block)
hr: zadrži trenutačno usmjerenje kornjače (može se upotrijebiti umjesto bloka ‘broj’)
sq: mban vlerën e tanishme të drejtimit të breshkës (mund të përdoret në vend të një numri blloku)
uk: зберігає поточне значення напрямку голови черепашки (може бути використано у місці числового блоку)

source: Palette of pen commands
hr: Upravljanje svojstvima olovke
sq: Paletë urdhrash pene
uk: Палітра команд пера

source: pen
hr: olovka
sq: penë
uk: перо

source: fill screen
hr: oboji zaslon
sq: mbushe ekranin
uk: заповнити екран

source: fills the background with (color, shade)
hr: ispuni pozadinu s (boja, sjenčanje)
sq: mbush sfondin me (ngjyrë, hije)
uk: заповнює тло з використанням параметрів (колір, відтінок)

source: set color
hr: zadaj boju
sq: caktoni ngjyrë
uk: встановити колір

source: sets color of the line drawn by the turtle
hr: zadaje boju linije koju crta kornjača kad se miče
sq: cakton ngjyrën e vijës së vizatuar nga breshka
uk: встановлює колір лінії, якою малюватиме черепашка

source: set shade
hr: zadaj sjenčanje
sq: caktoni hije
uk: встановити відтінок

source: sets shade of the line drawn by the turtle
hr: zadaje sjenčanje linije koju crta kornjača kad se miče
sq: cakton hijen e vijës së vizatuar nga breshka
uk: встановлює відтінок лінії, якою малюватиме черепашка

source: set gray
hr: zadaj sivilo
sq: caktoni shkallë të grisë
uk: встановити сірий

source: sets gray level of the line drawn by the turtle
hr: zadaje sivilo linije koju crta kornjača kad se miče
sq: cakton shkallë të grisë së vijës së vizatuar nga breshka
uk: встановлює рівень сірого лінії, якою малюватиме черепашка

source: holds current pen color (can be used in place of a number block)
hr: zadrži trenutačnu boju olovke (može se upotrijebiti umjesto bloka ‘broj’)
sq: mban ngjyrën e tanishme të penës (mund të përdoret në vend të një blloku numrash)
uk: зберігає поточний колір пера (може бути використано у місці числового блоку)

source: holds current pen shade
hr: zadrži trenutačno sjenčanje olovke
sq: mban ngjyrën e tanishme të penës
uk: зберігає поточний відтінок пера

source: holds current gray level (can be used in place of a number block)
hr: zadrži trenutačnu razinu sivila (može se upotrijebiti umjesto bloka ‘broj’)
sq: mban shkallën e tanishme të grisë (mund të përdoret në vend të një blloku numrash)
uk: зберігає поточний рівень сірого (може бути використано у місці числового блоку)

source: pen up
hr: digni olovku
sq: pena lart
uk: підняти перо

source: Turtle will not draw when moved.
hr: Kornjača neće crtati kad se miče.
sq: Breshka nuk do të vizatojë kur lëvizet.
uk: Черепашка не малюватиме, якщо пересуватиметься.

source: pen down
hr: spusti olovku
sq: pena poshtë
uk: опустити перо

source: Turtle will draw when moved.
hr: Kornjača će crtati kad se miče.
sq: Breshka do të vizatojë kur lëvizet.
uk: Черепашка малюватиме, якщо пересуватиметься.

source: pen down?
hr: pero spušteno?
sq: të ulet pena poshtë?
uk: перо опущено?

source: returns True if pen is down
hr: vraća Istinu ako je pero spušteno
sq: përgjigjet True, nëse pena është poshtë
uk: повертає True, якщо перо опущено

source: set pen size
hr: zadaj debljinu olovke
sq: caktoni madhësi pene
uk: встановити товщину пера

source: sets size of the line drawn by the turtle
hr: zadaje debljinu linije koju crta kornjača kad se miče
sq: cakton madhësinë e vijë së vizatuar nga breshka
uk: встановлює товщину лінії, якою малюватиме черепашка

source: start fill
hr: počni puniti
sq: fillo mbushje
uk: почати заповнення

source: starts filled polygon (used with end fill block)
hr: započinje ispunjavati poligon (koristi se s blokom ‘završi punjenje’)
sq: fillon shumëkëndësh të mbushur (e përdorur tok me bllok përfundim mbushjeje)
uk: починає заповнений кольором багатокутник (використовується із блоком «завершити заповнення»)

source: end fill
hr: završi puniti
sq: përfundoje mbushjen
uk: завершити заповнення

source: completes filled polygon (used with start fill block)
hr: završi s ispunjavanjem poligona (koristi se s blokom ‘počni puniti’)
sq: përfundon shumëkëndësh të mbushur (e përdorur tok me bllok fillimi mbushjeje)
uk: завершує заповнений кольором багатокутник (використовується із блоком «почати заповнення»)

source: pen size
hr: debljina olovke
sq: madhësi pene
uk: товщина пера

source: holds current pen size (can be used in place of a number block)
hr: zadrži trenutačnu debljinu olovke (može se upotrijebiti umjesto bloka ‘broj’)
sq: mban madhësinë e tanishme të penës (mund të përdoret në vend të një blloku numrash)
uk: зберігає поточну товщину пера (може бути використано у місці числового блоку)

source: Palette of pen colors
hr: Boje za olovku
sq: Paletë ngjyrash pene
uk: Палітра кольорів пера

source: colors
hr: boje
sq: ngjyra
uk: кольори

source: red
hr: crvena
sq: e kuqe
uk: червоний

source: orange
hr: narančasta
sq: portokalli
uk: жовтогарячий

source: yellow
hr: žuta
sq: e verdhë
uk: жовтий

source: green
hr: zelena
sq: e gjelbër
uk: зелений

source: cyan
hr: cijan
sq: gurkali
uk: блакитний

source: blue
hr: plava
sq: blu
uk: синій

source: purple
hr: ljubičasta
sq: e purpur
uk: пурпуровий

source: white
hr: bijela
sq: e bardhë
uk: білий

source: black
hr: crna
sq: e zezë
uk: чорний

source: RGB to color
hr: RGB u boju
sq: RGB në ngjyrë
uk: RGB у колір

source: converter
hr: pretvarač
sq: shndërrues
uk: перетворювач

source: Palette of numeric operators
hr: Matematički operatori
sq: Paletë operatorësh numerikë
uk: Палітра числових операторів

source: numbers
hr: brojevi
sq: numra
uk: числа

source: plus
uk: плюс

source: adds two alphanumeric inputs
hr: zbroji dva alfanumerička (slovno-brojčana) unosa
sq: bën mbledhjen e dy futjeve alfanumerike
uk: додає два буквено-цифрові вхідні записи даних

source: minus
uk: мінус

source: subtracts bottom numeric input from top numeric input
hr: oduzme dolje uneseni broj od gore unesenog broja
sq: bën zbritjen e vlerës numerike poshtë nga vlera numerike sipër
uk: віднімає нижні вхідні числові дані від верхніх вхідних числових даних

source: multiply
hr: pomnoži
sq: shumëzoni
uk: множити

source: multiplies two numeric inputs
hr: pomnoži dva unesena broja
sq: shumëzon dy vlera numerike që jepen
uk: множить два вхідних числа

source: divide
hr: podijeli
sq: pjesëtoni
uk: розділити

source: divides top numeric input (numerator) by bottom numeric input (denominator)
hr: podijeli gore uneseni broj (djeljenik) s dolje unesenim brojem (djelitelj)
sq: pjesëton vlerën numerike të dhënë sipër (të pjesëtueshmin) me vlerën numerike të dhënë poshtë (përcaktuesin)
uk: ділить верхнє вхідне число (чисельник) на нижнє вхідне число (знаменник)

source: identity
hr: jednakost
sq: identitet
uk: тотожне

source: identity operator used for extending blocks
hr: operator identičnosti koristi se za proširenje (razmak između) blokova
sq: operatori identitet i përdorur për zgjerim blloqesh
uk: оператор тотожності, що використовується для розширення блоків

source: mod
uk: модуль

source: modular (remainder) operator
hr: vraća ostatak dijeljenja dva cijela broja
sq: operatori modular (pjesa e mbetur)
uk: оператор модуля за основою (остачі)

source: square root
hr: kvadratni korijen
sq: rrënja katrore
uk: квадратний корінь

source: calculates square root
hr: izračuna kvadratni korijen
sq: llogarit rrënjën katrore
uk: обчислює квадратний корінь

source: random
hr: slučajni
sq: kuturu
uk: випадкове

source: min
uk: мін

source: max
sq: maks
uk: макс

source: returns random number between minimum (top) and maximum (bottom) values
hr: vraća slučajni broj između minimuma (gore) i maksimuma (dolje)
sq: jep një numër të rastësishëm, të përfshirë mes vlerave minimum (sipër) dhe maksimum (poshtë)
uk: повертає випадкове число між мінімальним (верхнім) значенням і максимальним (нижнім) значенням

source: number
hr: broj
sq: numër
uk: число
