Repository: Kiy4h/TortugadeMexico
Catalog: po/*.po
Languages: hr, sq, uk

source: TurtleBlocks
hr: Kornjača i blokovi
uk: Черепашко-блоки

source: Please wait
hr: Pričekaj
sq: Ju lutemi, pritni
uk: Будь ласка, зачекайте

source: Starting connection...
hr: Započinje povezivanje...
sq: Po niset lidhja…
uk: Запуск процедури з’єднання…

source: Export as python
hr: Eksport kao python
sq: Eksportoje si Python
uk: Експортувати як код python

source: Error: You must use a Start Block when exporting to Python.
hr: Greška: Za eksport u Python moraš rabiti blok ‘start’.
sq: Gabim: Kur eksportoni në Python, duhet të përdorni një Bllok Fillimi.
uk: Помилка: вам слід використовувати початковий блок, якщо ви експортуєте код Python.

source: snapshot
hr: snimka
sq: fotografim
uk: знімок

source: Turn off hover help
hr: Isključi kontekstnu pomoć
sq: Çaktivizoni shfaqje ndihme kur kalohet kursori përsipër
uk: Вимкнути контекстну довідку

source: Turn on hover help
hr: Uključi kontekstnu pomoć
sq: Aktivizoni shfaqje ndihme kur kalohet kursori përsipër
uk: Увімкнути контекстну довідку

source: Show palette
hr: Pokaži paletu
sq: Shfaq paletë
uk: Показати палітру

source: Hide palette
hr: Skrij paletu
sq: Fshihe paletën
uk: Приховати палітру

source: Show blocks
hr: Pokaži blokove
sq: Shfaq blloqe
uk: Показати блоки

source: Hide blocks
hr: Skrij blokove
sq: Fshihi blloqet
uk: Приховати блоки

source: Rescale coordinates down
hr: Razmjerno smanjenje koordinata
sq: Ripërmasoji koordinatat në më të vogla
uk: Зменшити масштаб координатних осей

source: Rescale coordinates up
hr: Razmjerno povećanje koordinata
sq: Ripërmasoji koordinatat në më të mëdha
uk: Збільшити масштаб координатних осей

source: Edit
hr: Uredi
sq: Përpunoni
uk: Зміни

source: View
hr: Pregled
sq: Shiheni
uk: Перегляд

source: Copy
hr: Kopiraj
sq: Kopjoje
uk: Копіювати

source: Paste
hr: Zalijepi
sq: Ngjite
uk: Вставити

source: Restore blocks from trash
hr: Vraća blokove iz smeća
sq: Rikthe prej hedhurinave blloqet
uk: Відновити блоки зі смітника

source: Save stack
hr: Spremi stȏg
uk: Зберегти стос

source: Delete stack
hr: Izbriši stȏg
uk: Вилучити стос

source: Fullscreen
hr: Po cijelom ekranu
sq: Sa krejt ekrani
uk: На весь екран

source: Cartesian coordinates
hr: Kartezijeve koordinate
sq: Koordinata karteziane
uk: Декартові координати

source: Polar coordinates
hr: Polarne koordinate
sq: Koordinata polare
uk: Полярні координати

source: Metric coordinates
hr: Metričke koordinate
sq: Koordinata metrike
uk: Метричні координати

source: Grow blocks
hr: Povećaj blokove
sq: Rriti blloqe
uk: Розширити блоки

source: Shrink blocks
hr: Smanji blokove
sq: Tkurri blloqet
uk: Стиснути блоки

source: Load example
hr: Učitaj primjer
sq: Ngarko shembullin
uk: Завантажити приклад

source: Save/Load
hr: Spremi/Učitaj
sq: Ruaje/Ngarkoje
uk: Зберегти/Завантажити

source: Project
hr: Projekt
sq: Projekt
uk: Проект

source: Clean
hr: Sve očisti
sq: Pastroje
uk: Спорожнити

source: Run
hr: Pokreni
sq: Ekzekutoje
uk: Виконати

source: Step
hr: Postupno, po korak
sq: Hap
uk: Крок

source: Stop turtle
hr: Zaustavi kornjaču
sq: Ndale breshkën
uk: Зупинити черепашку

source: Help
hr: Pomoć
sq: Ndihmë
uk: Довідка

source: Stop
sq: Ndale
uk: Зупинити

source: Share selected blocks
hr: Podijeli s nekim označene blokove
sq: Ndajini blloqet e përzgjedhur me të tjerët
uk: Оприлюднити позначені блоки

source: Save as image
hr: Spremi kao sliku
sq: Ruaje si figurë
uk: Зберегти як зображення

source: Save as icon
hr: Spremi kao ikonu
sq: Ruaje si ikonë
uk: Зберегти як піктограму

source: Save as ODP
hr: Spremi kao ODP
sq: Ruaje si ODP
uk: Зберегти як ODP

source: Save as Logo
hr: Spremi kao Logo
sq: Ruaje si Logo
uk: Зберегти як Logo

source: Save as Python
hr: Spremi kao Python
sq: Ruaje si Python
uk: Зберегти як Python

source: Save snapshot
hr: Spremi snimku
sq: Ruaje fotografimin
uk: Зберегти знімок

source: Add project
hr: Dodaj projekt
sq: Shtoni projekt
uk: Додати проект

source: Load plugin
hr: Učitaj plugin
sq: Ngarko shtojcën
uk: Завантажити додаток

source: Load Python block
hr: Učitaj blok ’Python’
sq: Ngarko bllok Python
uk: Завантажити блок Python

source: Palettes
hr: Palete
sq: Paleta
uk: Палітри

source: Sharing blocks disabled
hr: Dijeljenje blokova nije omogućeno
sq: Ndarja e blloqeve me të tjerët është çaktivizuar
uk: Оприлюднення блоків вимкнено

source: Save
hr: Spremi
sq: Ruaje
uk: Зберегти

source: Save blocks as image
hr: Spremi blokove kao sliku
sq: Ruaji blloqet si figurë
uk: Зберегти блоки як зображення

source: Load
hr: Učitaj
sq: Ngarkoje
uk: Завантажити

source: Open
hr: Otvori
sq: Hape
uk: Відкрити

source: Plugin %s already installed.
hr: Plugin %s je već instaliran.
sq: Shtojca %s është tashmë e instaluar.
uk: Додаток %s вже встановлено.

source: Do you want to reinstall %s?
hr: Želiš li ponovno instalirati %s?
sq: Doni të ri-instalohet %s?
uk: Хочете перевстановити %s?

source: My Turtle Art session
hr: Moja seansa s kornjačinom umjetnosti
sq: Sesioni im Arti i Breshkës
uk: Сеанс малювання черепашкою

source: Enable collaboration
hr: Omogući suradnju
sq: Aktivizoni bashkëpunimin
uk: Увімкнути співпрацю

source: Activities
hr: Aktivnosti
sq: Veprimtari
uk: Простори дій

source: Buddies
hr: Prijateljice/prijatelji
sq: Shokë
uk: Приятелі

source: Share
hr: Podijeli
sq: Ndarje me të tjerët
uk: Оприлюднити

source: Configuration
hr: Konfiguracija
sq: Formësim
uk: Налаштування

source: Neighborhood
hr: Susjedstvo
sq: Lagje
uk: Сусідство

source: Nickname
hr: Nadimak
sq: Nofkë
uk: Псевдонім

source: Account ID
hr: ID korisnikovog računa
sq: ID llogarie
uk: ІД облікового запису

source: Server
hr: Poslužitelj
sq: Shërbyes
uk: Сервер

source: Port
sq: Portë
uk: Порт

source: Password
hr: Lozinka
sq: Fjalëkalim
uk: Пароль

source: Register
hr: Prijava
sq: Regjistrohuni
uk: Зареєструватись

source: Colors
hr: Boje
sq: Ngjyra
uk: Кольори

source: Upload
hr: Slanje
sq: Ngarkoje
uk: Вивантажити

source: Facebook wall post
hr: Objava na Facebooku
sq: Postim në mur Facebook-u
uk: Допис на стіні Facebook

source: Upload to Web
hr: Pošalji na Web
sq: Ngarkojeni në Web
uk: Вивантаження у інтернет

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
hr: Moraš imati račun u http://turtleartsite.sugarlabs.org da im pošalješ svoj projekt.
sq: Që të ngarkoni projektin tuaj, duhet të keni një llogari te http://turtleartsite.sugarlabs.org.
uk: Для вивантаження вашого проекту вам слід мати обліковий запис на сайті http://turtleartsite.sugarlabs.org.

source: Username:
hr: Korisnik:
sq: Emër përdoruesi:
uk: Користувач:

source: Password:
hr: Lozinka:
sq: Fjalëkalim:
uk: Пароль:

source: Title:
hr: Naslov:
sq: Titull:
uk: Назва:

source: Description:
hr: Opis:
sq: Përshkrim:
uk: Опис:

source: Submit to Web
hr: Pošalji na Web
sq: Parashtrojeni në Web
uk: Надіслати до інтернету

source: Cancel
hr: Odustani
sq: Anuloje
uk: Скасувати

source: Login failed
hr: Prijava nije uspjela
sq: Hyrja dështoi
uk: Невдала спроба увійти

source: Failed to upload!
hr: Slanje nije uspjelo!
sq: Dështoi ngarkimi!
uk: Не вдалося вивантажити!

source: The path to the TurtleArt installation must be listed in the environment variable PYTHONPATH.
hr: Putanja do lokacije gdje je paket „Kornjača i blokovi“ instaliran mora biti naveden u varijabli okoline PYTHONPATH.
sq: Shtegu i instalimit të Artit të Breshkës duhet të jetë dhënë te ndryshorja PYTHONPATH e mjedisit.
uk: Шлях до встановленого TurtleArt має бути у списку шляхів змінної середовища PYTHONPATH.

source: Palette of flow operators
hr: Operatori toka programa
uk: Палітра операторів діаграми

source: while
hr: dokle
sq: teksa
uk: поки

source: do-while-True operator that uses boolean operators from Numbers palette
hr: operator ponavlja-dokle-Istina rabi logičke operatore iz palete „Matematički operatori“
sq: Operator do-while-True që përdor operatorë buleanë nga paletë Numrash
uk: оператор виконання, доки твердження справджується, у якому використовуються булеві оператори з палітри «Числа»

source: until
hr: dok je
sq: derisa
uk: доки

source: do-until-True operator that uses boolean operators from Numbers palette
hr: operator ponavlja-dok je-Istina rabi logičke operatore iz palete „Matematički operatori“
sq: Operator do-until-True që përdor operatorë buleanë nga paletë Numrash
uk: оператор виконання, доки твердження не справджується, у якому використовуються булеві оператори з палітри «Числа»

source: top
hr: vrh
uk: верх

source: top of a collapsible stack
hr: vrh sažimajućeg stȏga
uk: верх придатного до згортання стосу

source: Palette of media objects
hr: Medijski objekti
sq: Paletë objektesh media
uk: Палітра мультимедійних об’єктів

source: media
hr: mediji
uk: мультимедіа

source: journal
hr: dnevnik
sq: ditar
uk: журнал

source: Sugar Journal media object
hr: Medijski objekt iz Dnevnika
sq: Objekt media Ditari Sugar
uk: мультимедійний об’єкт журналу Sugar

source: audio
uk: звук

source: Sugar Journal audio object
hr: audio objekt iz Dnevnika
sq: Objekt audio Ditari Sugar
uk: звуковий об’єкт журналу Sugar

source: video
uk: відео

source: Sugar Journal video object
hr: video objekt iz Dnevnika
sq: Objekt video Ditari Sugar
uk: відеооб’єкт журналу Sugar

source: description
hr: opis
sq: përshkrim
uk: опис

source: Sugar Journal description field
hr: polje za opis u Dnevnik
sq: Fushë përshkrimi Ditari Sugar
uk: поле опису журналу Sugar

source: text
hr: tekst
sq: tekst
uk: текст

source: string value
hr: string, niz znakova
sq: vlerë vargu
uk: рядкове значення

source: show
hr: pokaži
sq: shfaqe
uk: показати

source: draws text or show media from the Journal
hr: nacrta tekst ili pokaže medije iz Dnevnika
sq: vizaton tekst ose shfaq media nga Ditari
uk: показує текст або мультимедійні дані з журналу

source: show aligned
hr: pokaži poravnato
uk: показати вирівняним

source: set scale
hr: određuje skalu
sq: caktoni shkallë
uk: встановити масштаб

source: sets the scale of media
hr: određuje razmjere medija
sq: cakton shkallën e medias
uk: встановити масштаб мультимедійного об’єкта

source: set font
hr: odredi tip slova
sq: caktoni shkronja
uk: встановити шрифт

source: sets the font used by the show block
hr: određuje tip slova koji rabi blok ‘pokaži’
sq: cakton shkronjat e përdorura nga blloku shfaqje
uk: встановити шрифт, який буде використано для показу об’єкта

source: save picture
hr: spremi sliku
sq: ruaje foton
uk: зберегти картинку

source: picture name
hr: ime slike
sq: emër fotoje
uk: назва картинки

source: saves a picture to the Sugar Journal
sq: ruan një foto te Ditari Sugar
uk: зберігає картинку до журналу Sugar

source: save SVG
hr: spremi SVG
sq: ruaje SVG-në
uk: зберегти SVG

source: saves turtle graphics as an SVG file in the Sugar Journal
sq: i ruan grafikët e breshkës si një kartelë SVG te Ditari Sugar
uk: зберігає графіку черепашки як файл SVG у журналі Sugar

source: scale
hr: razmjer
sq: shkallë
uk: масштаб

source: holds current scale value
hr: zadrži trenutačnu vrijednost razmjera
sq: mban vlerë të tanishme shkalle
uk: зберігає поточне значення масштабу

source: media wait
hr: čekanje na medije
sq: media në pritje
uk: зачекати відтворення

source: wait for current video or audio to complete
hr: čeka se da trenutačni video ili audio završi
sq: pritni të plotësohet videoja apo audioja e tanishme
uk: зачекати на завершення відтворення відео або звуку

source: media stop
hr: završi medije
sq: ndalesë medie
uk: припинення відтворення

source: stop video or audio
hr: završi video ili audio
sq: ndal audio ose video
uk: зупинити відео або звук

source: media pause
hr: zaustavi medije
sq: pushim medie
uk: пауза у відтворенні

source: pause video or audio
hr: zaustavi audio ili video
sq: pushoje videon ose audion
uk: призупинити відео або звук

source: media resume
hr: nastavi medije
sq: rimarrje medie
uk: відновити відтворення

source: resume playing video or audio
hr: nastavi reprodukciju videa ili audia
sq: rimerr luajtjen e videos ose audios
uk: відновити відтворення відео або звуку

source: speak
hr: govori
sq: flisni
uk: вимовити

source: hello
hr: pozdrav
sq: tungjatjeta
uk: привіт

source: speaks text
hr: izgvori tekst
sq: thotë tekstin
uk: вимовляє текст

source: sinewave
hr: sinusni val
sq: valë sinusoidale
uk: синусоїда

source: pitch
hr: visina zvuka
sq: lartësi tingulli
uk: тон

source: amplitude
hr: amplituda
sq: amplitudë
uk: амплітуда

source: duration
hr: trajanje
sq: kohëzgjatje
uk: тривалість

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
hr: odsvira sinusni val frekvencije, amplitude i trajanja (u sekundama)
sq: luan një valë sinusoidale me frekuencën, amplitudën dhe kohëzgjatjen (në sekonda) e dhënë
uk: відтворює синусоїдальний сигнал із вказаною частотою, амплітудою та тривалістю (у секундах)

source: Palette of sensor blocks
hr: Senzori
sq: Paletë blloqesh ndijuesish
uk: Палітра блоків датчиків

source: sensor
hr: senzor
sq: ndijues
uk: датчик

source: button down
hr: pritisnuti gumb
sq: shtypje butoni
uk: кнопку натиснуто

source: returns 1 if mouse button is pressed
hr: vraća 1 ako je gumb miša stisnut
sq: përgjigjet me 1, nëse shtypet butoni i miut
uk: повертає 1, якщо натиснуто кнопку миші

source: returns True if mouse button is pressed
hr: vraća Istinu ako je gumb miša stisnut
sq: përgjigjet me True nëse shtypet butoni i miut
uk: повертає True, якщо натиснуто кнопку миші

source: mouse x
hr: x miš
sq: x i kursorit
uk: x миші

source: returns mouse x coordinate
hr: vraća x koordinatu miša
sq: jep vlerën e koordinatës x për kursorin
uk: повертає координату x вказівника миші

source: mouse y
hr: y miš
sq: y i kursorit
uk: y миші

source: returns mouse y coordinate
hr: vraća y koordinatu miša
sq: jep vlerën e koordinatës y për kursorin
uk: повертає координату y вказівника миші

source: query keyboard
hr: iščita tipkovnicu
sq: provo tastierën
uk: запит клавіатури

source: query for keyboard input (results stored in keyboard block)
hr: iščita tipkovnicu (rezultat spremljen u blok ‘tipkovnica’)
sq: provo funksion tastiere (përfundimet depozitohen te blloku i tastierës)
uk: надіслати запит щодо введення даних з клавіатури (результати буде збережено у блоці клавіатури)

source: keyboard
hr: tipkovnica
sq: tastierë
uk: клавіатура

source: holds results of query-keyboard block as ASCII
hr: drži rezultat bloka ‘iščita tipkovnicu’ u ASCII formatu
sq: i mban si ASCII përfundimet e bllokut provo-tastierën
uk: зберігає результати введення до блоку запиту клавіатури у форматі ASCII

source: read pixel
hr: čitaj piksele
uk: читати піксель

source: RGB color under the turtle is pushed to the stack
hr: RGB boja ispod kornjače je gurnuta u stȏg
uk: дописує до стосу колір під черепашкою у форматі RGB

source: turtle sees
hr: kornjača vidi
sq: breshka sheh
uk: черепашка бачить

source: returns the color that the turtle "sees"
hr: vraća boju koju kornjača „vidi“
sq: jep ngjyrën që "sheh" breshka
uk: повертає колір, який «бачить» черепашка

source: time
hr: vrijeme
sq: kohë
uk: час

source: elapsed time (in seconds) since program started
hr: proteklo vrijeme (u sekundama) od pokretanja programa
sq: kohë (në sekonda) e rrjedhur që kur u nis programi
uk: час (у секундах), який минув з моменту запуску програми

source: Palette of extra options
hr: Dodatni blokovi za napredne mogućnosti
sq: Paletë mundësish ekstra
uk: Палітра додаткових дій

source: extras
hr: dodaci
sq: ekstra
uk: додаткове

source: push
hr: gurni
sq: <em>push</em>
uk: надіслати

source: pushes value onto FILO (first-in last-out heap)
hr: gurne vrijednost u FILO (first-in last-out heap; prvi unutra, zadnji van hrpa)
sq: vendos vlerë në FILO (first-in last-out heap)
uk: дописує значення до FILO (купи «першим записано — останніми видано»)

source: show heap
hr: pokaži hrpu
uk: показати купу

source: shows values in FILO (first-in last-out heap)
hr: pokaže vrijednost u FILO (prvi unutra, zadnji van hrpi)
sq: shfaq vlera në FILO (first-in last-out heap)
uk: показує значення у FILO (купі «першим записано — останніми видано»)

source: empty heap
hr: isprazni hrpu
uk: спорожнити купу

source: emptys FILO (first-in-last-out heap)
hr: isprazni FILO (prvi unutra zadnji, van hrpu)
sq: zbraz FILO-n (first-in-last-out heap)
uk: спорожняє FILO (купу «першим записано — останніми видано»)

source: pop
hr: izguraj
uk: отримати

source: pops value off FILO (first-in last-out heap)
hr: izgura vrijednost iz FILO (prvi unutra, zadnji van hrpe)
uk: отримує значення з FILO (купи «першим записано — останніми видано»)

source: empty heap?
hr: prazna hrpa?
uk: порожня купа?

source: returns True if heap is empty
hr: vraća Istinu ako je hrpa prazna
uk: повертає True, якщо купа порожня

source: save heap to file
hr: spremi hrpu u datoteku
uk: зберегти купу до файла

source: filename
hr: ime datoteke
sq: emër kartele
uk: назва файла

source: saves FILO (first-in last-out heap) to a file
hr: sprema FILO (prvi unutra, zadnji van hrpu) u datoteku
sq: e ruan FILO-n (first-in last-out heap) te një kartelë
uk: зберігає FILO (купу «першим записано — останніми видано») до файла

source: load heap from file
hr: učitaj hrpu iz datoteke
uk: завантажити купу з файла

source: loads FILO (first-in last-out heap) from a file
hr: učita FILO (prvi unutra, zadnji van hrpu) iz datoteke
sq: ngarkon FILO (first-in last-out heap) nga një kartelë
uk: завантажує FILO (купу «першим записано — останніми видано») з файла

source: comment
hr: komentar
sq: koment
uk: коментар

source: places a comment in your code
hr: dodaje komentar u tvoj kȏd
sq: vendos një koment te kodi juaj
uk: додає коментар до вашого коду

source: print
hr: ispiši
sq: shtype
uk: друкувати

source: prints value in status block at bottom of the screen
hr: ispiše vrijednost statusnog bloka na dno zaslona
sq: shtyp në fund të ekranit vlerë te bllok gjendjesh
uk: виводить значення до блоку стану, розташованого у нижній частині екрана

source: Python chr operator
hr: Python chr (znak) operator
sq: Operatori Python chr
uk: оператор chr Python

source: Python int operator
hr: Python int (cijeli broj) operator
sq: Operatori Python int
uk: оператор int Python

source: polar
hr: polarne
sq: polare
uk: полярна

source: displays polar coordinates
hr: prikaže polarne koordinate
sq: shfaq koordinata polare
uk: показує полярні координати

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
hr: programabilan blok za napredne matematičke funkcije s jednom varijablom, npr. sin(x)
sq: bllok i programueshëm: i përdorur për të shtuar ekuacione matematike të përparuar me një ndryshore, p.sh., sin(x)
uk: програмований блок: використовується для додавання складних однопараметричних функцій, наприклад sin(x)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
hr: programabilan blok za napredne matematičke funkcije s više varijabli, npr. sqrt(x*x + y*y)
sq: bllok i programueshëm: i përdorur për të shtuar ekuacione matematike të përparuar me disa ndryshore, p.sh., sqrt(x*x+y*y)
uk: програмований блок: використовується для додавання складних багатопараметричних функцій, наприклад sqrt(x*x+y*y)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
hr: programabilan blok za napredne matematičke funkcije s više varijabli, npr. sin(x+y+z)
sq: bllok i programueshëm: i përdorur për të shtuar ekuacione matematike të përparuar me disa ndryshore, p.sh., sin(x+y+z)
uk: програмований блок: використовується для додавання складних багатопараметричних функцій, наприклад sin(x+y+z)

source: Cartesian
hr: Kartezijeve
sq: Karteziane
uk: Прямокутні

source: displays Cartesian coordinates
hr: prikaže kartezijeve koordinate
sq: shfaq koordinata Karteziane
uk: показує декартові координати

source: Python block
hr: Python blok
sq: Bllok Python
uk: блок Python

source: runs code found in the tamyblock.py module found in the Journal
hr: izvrši kȏd nađen u tamyblock.py modulu nađen u Dnevniku
sq: xhiron kod të gjetur te moduli tamyblock.py që gjendet te Ditari
uk: виконує код, виявлений у модулі tamyblock.py, що зберігається у журналі

source: URL
uk: адреса

source: gets a text string or an image from a URL
hr: dobije tekstualni string (znakovni niz) ili sliku iz URL-a
sq: merr prej një URL-je një varg tekst ose një figurë
uk: отримує текстовий рядок або зображення за адресою

source: turtle shell
hr: kornjačin oklop
sq: zhguall breshke
uk: панцир черепашки

source: put a custom 'shell' on the turtle
hr: stavi „oklop“ po želji na kornjaču
sq: vendosni te breshka një 'zhguall' vetjak
uk: натягнути нетиповий «панцир» на черепашку

source: turtle
hr: kornjača
sq: breshkë
uk: черепашка

source: chooses which turtle to command
hr: odabire kornjaču kojoj će se zapovijedati
sq: zgjidhet cila breshkë të komandohet
uk: вибирає, якої черепашки стосується команда

source: turtle x
hr: kornjača x
sq: x breshke
uk: x черепашки

source: Returns x coordinate of turtle
hr: Vraća x koordinatu kornjače
sq: Jep koordinatën x të breshkës
uk: Повертає координату x черепашки

source: turtle y
hr: kornjača y
sq: y breshke
uk: y черепашки

source: Returns y coordinate of turtle
hr: Vraća x koordinatu kornjače
sq: Jep koordinatën y të breshkës
uk: Повертає координату y черепашки

source: active turtle
hr: aktivna kornjača
sq: breshka aktive
uk: активна черепашка

source: the name of the active turtle
hr: ime aktivne kornjače
sq: emri i breshkës aktive
uk: ім’я активної черепашки

source: turtle heading
hr: kornjačin smjer
sq: drejtim breshke
uk: напрям черепашки

source: Returns heading of turtle
hr: Vraća smjer kretanja kornjače
sq: Jep drejtimin e breshkës
uk: Повертає напрям голови черепашки

source: click to open
hr: klikni da otvoriš
sq: klikoni që të hapet
uk: натисніть, щоб відкрити

source: top of a collapsed stack
hr: vrh sažetog stȏga
uk: верх згорнутого стосу

source: select palette
hr: odaberi paletu
sq: përzgjidhni paletë
uk: вибрати палітру

source: selects a palette
hr: odabere paletu
sq: përzgjidhet një paletë
uk: вибирає палітру

source: load
hr: učitaj
sq: ngarkoje
uk: завантажити

source: forward
hr: naprijed
sq: përpara
uk: вперед

source: loads a block
hr: učita blok
sq: ngarkon një bllok
uk: завантажує блок

source: setxy
uk: встановити_xy

source: index
hr: indeks
sq: tregues
uk: індекс

source: return the text of the positions
hr: vraća tekst s pozicije
sq: jep tekstin e pozicionit
uk: повертає текст позицій

source: string
sq: varg
uk: рядок

source: start
sq: fillim
uk: почати

source: end
hr: završi
sq: fund
uk: завершити

source: Palette of presentation templates
hr: Predlošci za prezentaciju
sq: Paletë gjedhesh prezantimi
uk: Палітра шаблонів презентацій

source: portfolio
hr: portfelj
sq: portofol
uk: портфоліо

source: hide blocks
hr: skrij blokove
sq: fshihni blloqe
uk: приховати блоки

source: declutters canvas by hiding blocks
hr: očisti prozor skrivanjem blokova
sq: vini rregull te kanavaca duke fshehur blloqe
uk: спрощує вигляд полотна, приховуючи блоки

source: show blocks
hr: pokaži blokove
sq: shfaq blloqe
uk: показати блоки

source: restores hidden blocks
hr: vrati skrivene blokove
sq: rikthen blloqe të fshehur
uk: відновлює приховані блоки

source: hides the Sugar toolbars
sq: fsheh panelet e Sugar-it
uk: приховує панелі інструментів Sugar

source: list
hr: popis
sq: listë
uk: список

source: presentation bulleted list
hr: prezentacija s označenim popisom
sq: listë prezantimi me toptha
uk: список із позначками для презентації

source: presentation template: list of bullets
hr: predložak za prezentaciju: označeni popis
sq: gjedhe prezantimi: listë me toptha
uk: шаблон презентації: список з пунктами

source: presentation template: select Journal object (no description)
hr: predložak za prezentaciju: izaberi objekt iz Dnevnika (bez opisa)
sq: gjedhe prezantimi: përzgjidhni objekt Ditari (pa përshkrim)
uk: шаблон презентації: виберіть об’єкт журналу (без опису)
