Repository: Kiy4h/TortugadeMexico
Catalog: po/agr.po
Languages: agr

source: number
agr: Dekapat

source: used as numeric input in mathematic operators
agr: Atsumtaiyai waitnum dekapanum operadores matemáticos tawa nu

source: greater than
agr: Dúkape

source: logical greater-than operator
agr: Dukape operador lógico tawa nu

source: less than
agr: Ujumke

source: logical less-than operator
agr: Ujumke operador lógico nu

source: equal
agr: Betek

source: logical equal-to operator
agr: Takasmi betek operador lógico nu

source: not
agr: Atsa

source: logical NOT operator
agr: Takastin operador NO lógico

source: and
agr: y (nuwigtushkam)

source: logical AND operator
agr: Dekami operador Y lógico

source: or
agr: Ajutjamu

source: logical OR operator
agr: Dekami operador O lógico

source: wait
agr: Dakamsata

source: pauses program execution a specified number of seconds
agr: Itájitmikata takat umikbau dútikatnanu dekapat dutikatnanu segundos nu

source: forever
agr: Tuke

source: loops forever
agr: Awénata tuke

source: repeat
agr: Awénat

source: loops specified number of times
agr: Patakam dekapat imagnía

source: if
agr: iEh, Dekas

source: then
agr: Untsukám

source: if then
agr: Dekas untsukám

source: if-then operator that uses boolean operators from Numbers palette
agr: Aents takau, ehe, nuwintush takau operadores lógicos tawa npaletan dekapatainun

source: else
agr: Atsa

source: if then else
agr: Ehé, Untsukám, Atsa

source: if-then-else operator that uses boolean operators from Numbers palette
agr: Aents takau computador ehe, úntsu- nuniashkush takau operador lógico paleta dekapatnun

source: horizontal space
agr: Agkáju Horiontal tawa nunui

source: jogs stack right
agr: Akiíntut pila untsugmun

source: vertical space
agr: Akíntut akuúm

source: jogs stack down
agr: Akintut pila nunkan

source: stop action
agr: Itájit acción

source: stops current action
agr: Itájit yamaipat acción

source: Palette of variable blocks
agr: Takasmi Paleta de bloques de variables

source: top of nameable action stack
agr: Yakin pira acción nombrable

source: store in box 1
agr: Ukút cajanum makichik 1

source: stores numeric value in Variable 1
agr: Ukúkta valor numérico en la variable makichik 1 tawa nunu

source: store in box 2
agr: Ukút cajanum jimag 2

source: stores numeric value in Variable 2
agr: Ukúkta valor numérico en la variable jimag 2

source: box 1
agr: caja makichik 1

source: Variable 1 (numeric value)
agr: Takasmi Variable makichik 1 (valor numérico)

source: box 2
agr: Egkekta caja jimag 2

source: Variable 2 (numeric value)
agr: Takasmi Variable jimag 2 (valor numérico)

source: box
agr: Egketai

source: action 1
agr: Dútikatna nu makichik 1

source: top of Action 1 stack
agr: Dékatkau pira dútikatna nuwa makichik1

source: action 2
agr: Dútikatna nu jimag 2

source: top of Action 2 stack
agr: Dékatkau pira dutikatna nuwa jimag 2

source: invokes Action 1 stack
agr: Segamta atsumamu pira de acción tawa nu makichik 1

source: invokes Action 2 stack
agr: Segamta atsumamu pira acción tawa nu jimag 2

source: permanently deletes items in trash
agr: Tuke esakat waji awa papeleranum

source: restore all
agr: Patakam magkamata

source: restore all blocks from trash
agr: Dekami wajuk takataiyaita restaurar tawa nunu ashi bloques papeleranun

source: clear all
agr: Ashi esakagta

source: move all blocks to trash
agr: tsétse umushkata ashi ijumjamu awa nu.
