Repository: Kiy4h/TortugadeMexico
Catalog: po/agr.po
Languages: agr

source: TurtleBlocks
agr: Kugkúim

source: snapshot
agr: Wáamak

source: Turn off hover help
agr: Agkántu asamatai yáimu flotante tawa nunu.

source: Turn on hover help
agr: Shig wakeas atunit wampumát

source: Show palette
agr: Iwainakta paleta

source: Hide palette
agr: Uút paleta

source: Show blocks
agr: Inakmasta ijundaiju

source: Hide blocks
agr: Uúkta ijumjamu

source: Rescale coordinates down
agr: Wát coordenadas tawa nu nugkan.

source: Rescale coordinates up
agr: Wát coordenadas tawa nu yakin.

source: Edit
agr: Agagta dutikam inakmasta

source: View
agr: Diít

source: Copy
agr: Enagket

source: Paste
agr: Anujut

source: Restore blocks from trash
agr: Patakam awagkin itanta bloques de la papelera tawa nu

source: Save stack
agr: Pira ukúkta

source: Delete stack
agr: Esakáut pira

source: Fullscreen
agr: Pantalla muun emata

source: Cartesian coordinates
agr: Takasmi Coordenadas cartesianas

source: Polar coordinates
agr: Takasmi Coordenadas polares

source: Metric coordinates
agr: Takasmi Coordenadas centímetros

source: Grow blocks
agr: Ayampaut bloques tawa nu.

source: Shrink blocks
agr: Uchuchiji emamu bloques

source: Load example
agr: Egkét diisa takastin

source: Save/Load
agr: Ukút/Aimat

source: Project
agr: Takat umikbau najanamu

source: Clean
agr: Jaupit

source: Run
agr: Dútikat, áikat

source: Step
agr: Sút makichik nagkáemamu

source: Stop turtle
agr: Itájitmikata kugkúim

source: Help
agr: Yaimat

source: Stop
agr: Itájit

source: Share selected blocks
agr: Tindamdaikatajum bloques tawa nu etegjamu

source: Save as image
agr: Ukúkta kuitamkam dakumkamujai

source: Save as Logo
agr: Ukút wajuk awa logo tawa nu

source: Save snapshot
agr: Ukút wáamak

source: Load plugin
agr: Aimkata plugin

source: Load Python block
agr: Entsát bloque Python

source: Palettes
agr: Dekami Paletas

source: Sharing blocks disabled
agr: Tinamdaiyatajum bloques deshabilitado awa nu

source: Save
agr: Ukukta

source: Open
agr: Ujat

source: Plugin %s already installed.
agr: El plugin %s juka instalamuwai.

source: Do you want to reinstall %s?
agr: ¿Patakam instalatakumek %s?

source: My Turtle Art session
agr: Takat umikbau kugkúimArtenu

source: Enable collaboration
agr: Tsagkamát shig wakegas yáimu

source: Activities
agr: Unuimaku takastin

source: Buddies
agr: Tsanitai

source: Share
agr: Tinamdaiyatajum

source: Configuration
agr: Ashi programa computadornum awa nuna tawai

source: Neighborhood
agr: Pata ijuntsa batsatkamu

source: Nickname
agr: Iwájsa andaikamu

source: Account ID
agr: Augmatsata

source: Server
agr: Aents tikichdau takau

source: Port
agr: Anuúmtai

source: Password
agr: Daa agagbau amek dekamu, tikich inaktumainchuitme.

source: Register
agr: Daa agagbau abacha diisa

source: Colors
agr: Niimé

source: Upload
agr: Aimat

source: Facebook wall post
agr: Diismi muro de facebook

source: Upload to Web
agr: Awemata Webnum

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
agr: Ajumainai bakichik cuenta internetnum http://turtleartsite.sugarlabs.org Takat umiktin najanamu agagbau jiktatambau.

source: Username:
agr: Usuario:

source: Password:
agr: Daa agagbau amek dekamu, tikich inaktumainchuitme.

source: Title:
agr: Umiktin

source: Description:
agr: Niime augmatbau:

source: Submit to Web
agr: Awamata nanum Webnum

source: Cancel
agr: Takamu ukuta

source: Login failed
agr: Besegbáu autentificación

source: Failed to upload!
agr: ¡Besegbau descargarDewat!

source: Palette of flow operators
agr: Takasmi Paleta de operadores de flujo

source: while
agr: Tujamtai

source: do-while-True operator that uses boolean operators from Numbers palette
agr: Dutikattaji kuwashat takat bloquesnu nuniak umimkattawai wajuk jasa atatua yama nagkabau aanik.

source: until
agr: Ejeyi

source: do-until-True operator that uses boolean operators from Numbers palette
agr: Takat dutikatin kuwashat bloquesnu ejetatabaunum shig pegken ati tambau

source: top
agr: Náin

source: top of a collapsible stack
agr: Náin pira abaunum plegable tawa nunu

source: Palette of media objects
agr: Paleta de bloques medios

source: journal
agr: Tsawantai

source: Sugar Journal media object
agr: Wají aidau takatai diarionun yumintsak

source: audio
agr: Shinau antumu, ejesmamu egkekbau.

source: Sugar Journal audio object
agr: Wají aidau antutainum diario nu yumintsak

source: video
agr: Dakumkamu inakmamu

source: Sugar Journal video object
agr: objeto de video del Diario de Sugar

source: description
agr: Niíme augmatbau

source: Sugar Journal description field
agr: Wasugkamtainum niime augmatbau diario nu yumintsak

source: text
agr: Chicham agagbau

source: string value
agr: Takasmi valor de cadena tawa nu

source: show
agr: Inakmasta

source: draws text or show media from the Journal
agr: Dakumkata chicham agagbau nuniashkumesh inakmasta takatai aidau diarionu pujasa

source: show aligned
agr: Inakmasta tsegtsagbau

source: set scale
agr: Etégket

source: sets the scale of media
agr: fijar la escala de mediosEtégket escala medios nu tawa nunu

source: save picture
agr: Ukukta dakumkamu

source: picture name
agr: Daa agagbau dakumkamunu

source: saves a picture to the Sugar Journal
agr: Egkékta dakumkamu diario yumintskanu

source: save SVG
agr: Ukukta SVG

source: saves turtle graphics as an SVG file in the Sugar Journal
agr: Ukúkta kugkúimnu tsentsagbau wajuk archivo SVG diarionu yumintsakanu

source: scale
agr: Wáit númi átuimunum

source: holds current scale value
agr: Aintsan wai senchiji yamaipat wáitnum

source: media wait
agr: Dakasta medios tawa nu.

source: wait for current video or audio to complete
agr: Dakasta ejeyi betekmam antutai nuwintu diitai

source: media stop
agr: Itajitmikata medios tawa nu

source: stop video or audio
agr: Itajit video diiyamu nuniashkush audio antamu

source: media pause
agr: Itajitmikata medios tawa nu

source: pause video or audio
agr: Itajitmikata video diamnu nuniashkush antam nu

source: media resume
agr: Emát medios tawa nu

source: resume playing video or audio
agr: Patakam video ipujata nuniaskumes ishigkata antukmi

source: speak
agr: Chichat

source: hello
agr: Amekaitam

source: speaks text
agr: Tawai agagbaunum

source: sinewave
agr: Tsegtsanbau aidau tuninniju.

source: pitch
agr: Dekami frecuencia Radio chichamu antutai

source: amplitude
agr: Agkáju

source: duration
agr: Dukap rsawan awai

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
agr: Dakumjata tsegkagbau aidau frecuencianu pujusam, aintsan amplitud nuwintu dukap(segundos tawa nu)

source: Palette of sensor blocks
agr: Paleta de bloques sensor

source: button down
agr: Butun iniinam awai

source: returns 1 if mouse button is pressed
agr: Wakitkita chik1 butun katipnu iiniman nunishkush enekmam akuin

source: returns True if mouse button is pressed
agr: Awankita dekaskea nu, butun katipnu iininam ematuam akuin

source: mouse x
agr: usor x tawa nunu

source: returns mouse x coordinate
agr: Awankita cordenada tawa nunu x corsornu

source: mouse y
agr: cursor y cursor tawa duka nágkijai betekai juka ujapawai utugni emattame pantallanum ame umuchiakme mause tawa nunu mainkatame betek buchitkattawai.

source: returns mouse y coordinate
agr: retorna la coordenada y del cursor

source: query keyboard
agr: Iimimsa dekata teclado

source: query for keyboard input (results stored in keyboard block)
agr: Inimsata wajuk wáitaita tecadonum (Jigbau aidau wai almacenamunum bloque tecladonum)

source: keyboard
agr: Abacha agagbau computadornum pekakbau, chicham agatai

source: holds results of query-keyboard block as ASCII
agr: ASCII Imajuin jigbau awai bloque tawa nundau, aintsan teclado iinimain jutikam ACII

source: read pixel
agr: Augbau pixel

source: RGB color under the turtle is pushed to the stack
agr: Pira emaji jakimtikbaunum RGB kugkúma nugkanjin

source: turtle sees
agr: Kugkúim waipawai

source: returns the color that the turtle "sees"
agr: Inakmasta jakimtiktai kugkúim wainu /"ve"/

source: time
agr: Tsawan

source: elapsed time (in seconds) since program started
agr: Tsawan nagkaemakbau(segundos tawa nu) takat nagkama umikbau

source: Palette of extra options
agr: Paletanu etegjata ame tuwa atsumame

source: push
agr: Ijumjamu pekakbau awántak

source: pushes value onto FILO (first-in last-out heap)
agr: Dekami apila ajánchat pira nu (primero en entrar, último en salir)

source: show heap
agr: Inakmasta pira

source: shows values in FILO (first-in last-out heap)
agr: Inakmasta valores a pira(émat wáit, inánamunum jinkittaja)

source: empty heap
agr: Agkán emata pira

source: emptys FILO (first-in-last-out heap)
agr: Agkán emata pira(émat wáit, inánamunum jinkittajai)

source: pop
agr: Jikta

source: pops value off FILO (first-in last-out heap)
agr: Jikta valor piranu (émat wáit, inágnamunum jiinkittajai)

source: empty heap?
agr: pira agkán?

source: returns True if heap is empty
agr: Awankin tita dekasketkun pira agkán akug

source: comment
agr: Augmatsata

source: places a comment in your code
agr: Agagta chicham sutamak augmatsata códigonum

source: print
agr: Papi agagbau egkekbau betek dakumak jiyau.

source: prints value in status block at bottom of the screen
agr: Dakumak jiiyawai papin betek egkekbau nuwintu senchiji bloquenu shig takamain, aintsak pujawai initken pantallanum

source: Python chr operator
agr: Yacha aents ishinin chr de Python

source: Python int operator
agr: Yacha ishinin int de Python

source: displays polar coordinates
agr: Iwainakta coordenadas polares tawa nu.

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
agr: Chik najankamu takamain: esegamu páchinat ecuaciones matemáticas avanzadas de una variable, p.e., seno(x)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
agr: Chik najankamu takamain: esegamu íjut takamu ecuaciones matemáticas avanzadas de múltiples variables, i.e., sqrt(x*x+y*y)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
agr: Chik najankamu takamain: esegámu takamain ecuaciones matemáticas avanzadas multivariables, p.e. seno(x+y+z)

source: Cartesian
agr: Takasmi Cartesiana

source: displays Cartesian coordinates
agr: Inakmasta coordenadas cartesianas

source: Python block
agr: Najankamu Python

source: runs code found in the tamyblock.py module found in the Journal
agr: Umikta ejecuta el código del módulo tamyblock.py que se encuentra en el Diario

source: turtle shell
agr: Duwáp kugkúimnu

source: put a custom 'shell' on the turtle
agr: Apujata kugkúima duwápe personaliza tawa nu kugkúimnu

source: turtle
agr: Kugkúim

source: chooses which turtle to command
agr: Ándaikata tuu kugkúima ijúmat

source: active turtle
agr: Kugkúim takamain tortuga activa

source: the name of the active turtle
agr: Daa kugkúimnu takamain paan awai

source: click to open
agr: Imajui pijit ininata dutikam ujanattawai

source: top of a collapsed stack
agr: Náin makichik pira awai kakekau

source: selects a palette
agr: Etegjata chik paleta

source: load
agr: Egkét

source: forward
agr: Eem

source: loads a block
agr: Egkét chik bloquenum

source: setxy
agr: Etegkat xy

source: start
agr: Nagkamu

source: Palette of presentation templates
agr: Paleta plantillanu iwainmamu

source: hide blocks
agr: Uumát bloques

source: declutters canvas by hiding blocks
agr: Jaupjata lienzo uwau bloquen

source: show blocks
agr: Iwainat bloques tawa nu.

source: restores hidden blocks
agr: Iwainat blokes tawa nu uukbau

source: hides the Sugar toolbars
agr: Uumát barras herramientas tawa nundau yumintskanu

source: list
agr: Uminas

source: presentation bulleted list
agr: Iwainmamu uminas viñetas tawa nunu.

source: presentation template: list of bullets
agr: plantillanum iwainamu: Uminas awai viñetas tawa nu

source: presentation template: select Journal object (no description)
agr: plantillanum iwainmamu: Etegjata wají diarionu (niime augmattsashbau)

source: presentation template: select Journal object (with description)
agr: plantillanum iwainmamu: Etegjata wají diarionum (niime augmatbau)

source: presentation template: select four Journal objects
agr: plantillanum iwainmamu:Etegjata sup wají Diarionu

source: presentation template: select two Journal objects
agr: plantillanum iwainmamu: Etegjata jim wajì diarionu

source: left
agr: Mena

source: xcor of left of screen
agr: coorx awai menanum pantalllanum

source: bottom
agr: Initken

source: ycor of bottom of screen
agr: coory tawa duka awai limiteinum nugkan pantallanum

source: width
agr: Wegkantí

source: the canvas width
agr: Lienzo Wegkantí

source: right
agr: Untsun

source: xcor of right of screen
agr: xcornum awai yagtamen untsugnum pantallanu

source: ycor of top of screen
agr: ycor pujawai limite yakig pantallanum

source: height
agr: Esánji

source: the canvas height
agr: Yakinjin lienzo nu

source: title x
agr: Umiktin x

source: title y
agr: Umiktin y

source: left x
agr: Mena x

source: top y
agr: Yakí y

source: right x
agr: Untsugnum x

source: bottom y
agr: Initken y

source: Palette of user-defined operators
agr: Paleta de operaciones tawa nunu umikbauwai usuario takamaina nunu

source: brightness
agr: Etsánbau

source: light level detected by camera
agr: Betek etsánbauji wainkae cámara

source: camera output
agr: Dakumkamu Kamarajai

source: Average RGB color from camera is pushed to the stack
agr: Betek mamtin usuamu RGB cámaranu buchitui piranum

source: read value from RFID device
agr: Augui dispoditivo akíke radiofrecuenciaji (RFID)

source: acceleration
agr: acelerómetro

source: push acceleration in x, y, z to heap
agr: Apújut wamketush ejes tawa nundau x,y z piranum

source: light level detected by light sensor
agr: Betek etsánbauji wainkae sensor tawa nunu.

source: sound
agr: Shinut

source: raw microphone input signal
agr: Mamikit wait micrófonon

source: loudness
agr: Sénchi

source: microphone input volume
agr: Sénchi wáit microfononum

source: microphone input pitch
agr: Riodio frecuenciaji senchi chuchau nuwintu shig antundau microfononum chichcam wayak

source: resistance
agr: Átsanbau

source: microphone input resistance
agr: Akíke átsanbau ijuk achitkau waitainum micrófononum (rango de medición: 700 a 14000 ohms)

source: voltage
agr: Sénchi japijatin

source: microphone input voltage
agr: Akíke senchi japijatnunum DC ijuka waitnu micrófonunum (rango: 0.40 a 1.90 V),

source: uturn
agr: Ayampat U

source: Please install the Speak Activity and try again.
agr: Wait aneasam instalata unuimaku takastin Chichat patakam ataktu umikta.

source: Spanish
agr: Apach

source: English
agr: Inglésnum

source: Sorry, I can't understand what you are asking about.
agr: Tsagkuntunta, antumain dekapeasjai tuwa ininme.

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
agr: Tsagkuntunta, atsawai memorianum agkan mina butsukjui egkéktatamunum. Epenta tikich unuimaku takastin dutikakum patakam ataktu egkékta.

source: other
agr: Tikich

source: push destination rgb value to heap
agr: Dekami apila el valor rgb a la pila

source: stop
agr: Itájit

source: play
agr: Ataktu nagkama ishinat, nunishkush kuwashat papi agagbau copia jigbaush amainai.

source: save
agr: Ukukta

source: did not output to
agr: Agamainchau dekapeajai awi

source: doesn't like
agr: Dakitun diiawai

source: as input
agr: Wajuk waít

source: I don't know how to
agr: Dekasjai wajuk dutikmainitja

source: usage is
agr: Takatai juwai

source: No option action:
agr: Dutikmainchau nuwintu atsawai utunmainuk:

source: File not found
agr: Ficheronum wainkasbau

source: Configuration directory not writable: %s
agr: Directorio tawa duka atsumtaiyai tsawan mamikia takamua nunu aintsan configuracion tawa duka etsejui wajiyai programa takame nuwintu yapajiam takamainchauwaitme %s directorinu

source: New
agr: Yamájam, yamájma

source: Save as
agr: Ukút wajúk ame wakegame

source: image
agr: Dakumkamu

source: Quit
agr: Jinat

source: File
agr: Papi agagbau shig ijumjamu wajuk takatan uminawa.

source: Rescale coordinates
agr: Iyántut coordenadas

source: Reset block size
agr: Pataka amaímat esánji bloquenu

source: Show/hide blocks
agr: Ináktut/uút bloques tawa nu

source: Tools
agr: Ashi atsumkas takatai aidau xo

source: Debug
agr: Shig jaupit, jiit pegkenchauji emau

source: Turtle
agr: Kugkúim

source: About...
agr: Pachísa...

source: You have unsaved work. Would you like to save before quitting?
agr: Away takat umikbau tujash ukukchamu.¿Wait aneasam eke jiintsuk ukúmainkitam?

source: Save project?
agr: Egkekta takat umiktin najanamu

source: Please restart %s in order to use the plugin.
agr: Patakam nagkamata %s tawa nu dutikam takamainitme Plugin,

source: Please restart %s in order to unload the plugin.
agr: Patakam nagkamata %s tawa nu dutikam takamainitme Plugin,

source: displays next palette
agr: Iwainakta tikich paleta tawa nu

source: changes the orientation of the palette of blocks
agr: Yapajiata wajuk paleta ijunjam awa nu.

source: trash
agr: Pegkenchau, tsuwat

source: orientation
agr: Chichajut

source: next
agr: Tikich

source: shift
agr: Yaja emamu

source: action
agr: Dutikin

source: my box
agr: Nima cajan

source: Select blocks to share
agr: Etegjata ikaugbau dutikam tikich aidaujai sudaisatajum.

source: Really overwrite stack?
agr: Wakeamek patakam agagta pira

source: Overwrite stack
agr: Patakam agagta pira

source: Really delete stack?
agr: ¿Wakeamek pira ajápet ?

source: empty trash
agr: Yajat papeleranum

source: xcor
agr: Dekami coorx

source: ycor
agr: Dekami coory

source: heading
agr: wétin

source: shade
agr: Ameinai yakagbau, jakimtikbau

source: gray
agr: Bukusea

source: color
agr: Yakagta

source: invokes named action stack
agr: Wait aneasam pira de acción nombrado

source: named variable (numeric value)
agr: Takasmi variable adaikamu (valor numérico)

source: store in
agr: Egkét

source: value
agr: Akike

source: stores numeric value in named variable
agr: Ukúkta valor numérico en la variable adaikamunum

source: Plugin could not be installed.
agr: Plugin tawanunu instalaumainchui

source: Title
agr: Umiktin

source: Load...
agr: Egkét....aimat

source: Save...
agr: Ukút

source: Palette of turtle commands
agr: Paleta de comandos tawa nu kugkúimdau

source: moves turtle forward
agr: Kugkúim eem umushkata

source: back
agr: Ukunmatai

source: moves turtle backward
agr: Kugkúim umushkata ukunum

source: clean
agr: Jaupit

source: clears the screen and reset the turtle
agr: Jaupjata computador pantallaji, dutikamin ataktu iman shig pegken wantinkattawai

source: turns turtle counterclockwise (angle in degrees)
agr: Kugkúim papegátmikata sentido anti-horario tawa nui (ángulos en grados)

source: turns turtle clockwise (angle in degrees)
agr: Kugkúim papegátmikata sentido horario( ángulos en grados)

source: arc
agr: Dekami wajukuita arco

source: angle
agr: Dekamiwajukuita ángulo

source: radius
agr: Dekami wajukuita arco

source: moves turtle along an arc
agr: Kugkúim umushkata a lo largo de un arco

source: set xy
agr: Etégkat xy

source: x
agr: Sapagket

source: y
agr: y (nuwintushkam)

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
agr: Kugkúim umushkata jutik tawa nu xcor, ycor; (0,0) ejapen pujawai pantallanum.

source: set heading
agr: Emamkemat rumbo tawa nu

source: sets the heading of the turtle (0 is towards the top of the screen.)
agr: Emamkemat kugkúim utugni etamua (Ten , emewai yakintin pantallanum )

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
agr: Awai coordenadas tawa nu x yamaipat kugkúimdau (takamainai atsumtsuk chik bloque tawau dekapat)

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
agr: Awai coordenada nuwintushkam yamaipat kugkúim (takamainai atsumtsuk makichik1 bloque tawa nu dukapdau)

source: holds current heading value of the turtle (can be used in place of a number block)
agr: Imajuig awai wajuk kugkúimash emattaji(Takamaini atsumtsuk dekapat )

source: Palette of pen commands
agr: Paleta tawa duka ujapawai wajiyaiya agagtatme

source: fill screen
agr: Pantallanum aimkata

source: fills the background with (color, shade)
agr: Aimkata initken (ususata, wakan)

source: set color
agr: Mamakjata wajiyaiya usuatmame

source: sets color of the line drawn by the turtle
agr: Mamikjata wajiyaiya kugkúimash dakumkash tsegtakbaunas usuattawa

source: set shade
agr: Mamikjata wajuk usuattame

source: sets shade of the line drawn by the turtle
agr: Mamikiata tsegtsakbaush wajuk ashimkattame usuamesh kugkúim dakumkamush

source: set gray
agr: Mamikjata bukuseayai

source: sets gray level of the line drawn by the turtle
agr: Imajui awai wajupa usuamush washuttaku tsegtsagbaunum atsumtatme kugkúim dakumkamu

source: holds current pen color (can be used in place of a number block)
agr: Awai yamaipat jakimtikbau agatainujai betek (Takamainai bloque dekapatainu achitsuk)

source: holds current pen shade
agr: Yamaipat umikbau agatainum ashi awai

source: holds current gray level (can be used in place of a number block)
agr: Imajui ujapawai betekji washuttakunu(takamainai atsumtsuk bloque tawanu dekapatainu)

source: pen up
agr: Ujakta papi agatai

source: Turtle will not draw when moved.
agr: Kugkúim dakumkashtatui buchitkun

source: pen down
agr: Nugkan emata agatai

source: Turtle will draw when moved.
agr: Kugkúim dakumkattawai buchitkun

source: set pen size
agr: Etégkata esanti

source: sets size of the line drawn by the turtle
agr: Etégkata tsegtsakbua wegkanti kugkuim dakumkamu.

source: start fill
agr: Nagkamam ainmat, betekmat

source: starts filled polygon (used with end fill block)
agr: Kagkamam betekmata poligononum (takasbau nagkánbaunum betekmata bloquenum)

source: end fill
agr: Inágnakta betekmam

source: completes filled polygon (used with start fill block)
agr: Betékmata polígononum ainmat (Esegámu nagkamata iammat bloquenum)

source: pen size
agr: Apují

source: holds current pen size (can be used in place of a number block)
agr: Awai esánji yamaipat agatainu (Atsumkas takamainai bloquejainchukesh dekapatainu)

source: Palette of pen colors
agr: Paletaum wai kuwashat usumatai nuwintu agatai

source: red
agr: Kapantu

source: orange
agr: Yagkuttaku

source: yellow
agr: Yagku

source: green
agr: Samekmau

source: cyan
agr: cian

source: blue
agr: Wigka

source: purple
agr: Yamakái

source: white
agr: Púju

source: black
agr: Bukúsea

source: Palette of numeric operators
agr: Paletanum awai operadores tawa nu numéricos

source: plus
agr: Ikaubau

source: adds two alphanumeric inputs
agr: Ikaubau jim agagta alfanumérica tawa nunui.

source: minus
agr: Atanbau

source: subtracts bottom numeric input from top numeric input
agr: Jikta wayámunu numérica nugkan wayámunum numérica yakin awa nunu

source: multiply
agr: Uyugkami

source: multiplies two numeric inputs
agr: Uyugkami jim waít dekapatnum

source: divide
agr: Akanmau

source: divides top numeric input (numerator) by bottom numeric input (denominator)
agr: Akanmau wayámunum numérica yakin (numeradornum) waitainum numérica nugkan(denominadornum)

source: identity
agr: Wainkámu

source: identity operator used for extending blocks
agr: operador de identidad tawa duka atsumtaiyai ayapantatabaunum bloque de operador tawa nunu.

source: mod
agr: Juka ujapawai waji dutikattame nu

source: modular (remainder) operator
agr: operador módular (resto)

source: square root
agr: Raiz cuadrada takastin

source: calculates square root
agr: Raíz cuadrada takastin

source: random
agr: Kakastin aleatorio

source: min
agr: Ujumak

source: max
agr: Kuwashat

source: returns random number between minimum (top) and maximum (bottom) values
agr: Awankita dekap aleatorio entre los valores mínimo (yakin) y máximo (nugkan)
