Repository: Kiy4h/TortugadeMexico
Catalog: po/ayc.po
Languages: ayc

source: TurtleBlocks
ayc: TurtuBlocks

source: Please wait
ayc: Mira suma, suyt'ma

source: Starting connection...
ayc: Qhantayaña qalltaskiwa...

source: Export as python
ayc: Python ukaru apt'ayma.

source: Error: You must use a Start Block when exporting to Python.
ayc: Pantjiwa: Python ukaru apt'ayañatakixa, mä qalltaña wakichawi apnaqañamaxa.

source: snapshot
ayc: ukjawraspacha

source: Turn off hover help
ayc: Tuytiri yanapt'a qulluyaña

source: Turn on hover help
ayc: Tuytiri yanapt'a qhantayaña

source: Show palette
ayc: Saminaka uchaña uñachayaña

source: Hide palette
ayc: Samik'ullu imantaña

source: Show blocks
ayc: Bloque satanaka uñachayaña

source: Hide blocks
ayc: Bloque satanaka imantaña

source: Rescale coordinates down
ayc: Coordenadanaka aynacharu jithintayaña

source: Rescale coordinates up
ayc: Coordenadanaka alaxaru jithsuyaña

source: Edit
ayc: Askichaña

source: View
ayc: Unjaña

source: Copy
ayc: Apaqaña

source: Paste
ayc: Lip'katayaña

source: Restore blocks from trash
ayc: Jani wakisiri imata t'aqanaka wasitatha sartayma.

source: Save stack
ayc: Pila sata arku imaña

source: Delete stack
ayc: Pila sata arku chhaqtayaña

source: Fullscreen
ayc: Pantalla ukch'pacha

source: Cartesian coordinates
ayc: Coordenadas cartesianas sata

source: Polar coordinates
ayc: Coordenadas polares sata

source: Metric coordinates
ayc: Coordenadas centímetros sata

source: Grow blocks
ayc: T'aqanaka jach'aptayaña

source: Shrink blocks
ayc: T'aqanaka isk'aptayaña

source: Load example
ayc: Yant'añanaka wakichata uñstayaña

source: Save/Load
ayc: Imaña/Ch'amanchaña

source: Project
ayc: Amtawi

source: Clean
ayc: Pichsuña

source: Run
ayc: Sarantayaña

source: Step
ayc: Maya chillqtaña

source: Stop turtle
ayc: Turtuwa acht'ayaña

source: Help
ayc: Yanapt'a

source: Stop
ayc: Acht'ayaña

source: Share selected blocks
ayc: Ajllita t'aqanaka t'uqiyaña

source: Save as image
ayc: Jamuqjama imaña

source: Save as icon
ayc: Jamuqa chimpjama imaña

source: Save as ODP
ayc: ODP wakichatjama imaña

source: Save as Logo
ayc: Logo wakichatjama imaña

source: Save as Python
ayc: Python wakichatjama imaña

source: Save snapshot
ayc: Ukjawrasa apsuta imaña

source: Add project
ayc: Amtawi wakichatampi yapxataña

source: Load plugin
ayc: Plugin wakichata sartayaña

source: Load Python block
ayc: Python sata t'aqa sartayaña

source: Palettes
ayc: Samik'ullunaka

source: Sharing blocks disabled
ayc: Acht'ayata t'aqanaka t'uqiyaña

source: Save
ayc: Imaña

source: Load
ayc: Sartayaña

source: Open
ayc: Llawiraña

source: Plugin %s already installed.
ayc: Plugin %s sataxa uskuntatäxiwa.

source: Do you want to reinstall %s?
ayc: ¿Mayampi %s ukhama sata uskuntaña muntati?

source: My Turtle Art session
ayc: TortugArte wakichata lurawija

source: Enable collaboration
ayc: Yanapt'asiña iyaw sasa katuqaña

source: Activities
ayc: Lurawinaka

source: Buddies
ayc: Masinaka

source: Share
ayc: T'uqiyaña

source: Configuration
ayc: Askichaña

source: Neighborhood
ayc: Jak'ankiri masinaka

source: Nickname
ayc: K'ari suti

source: Account ID
ayc: Mantañataki suti

source: Server
ayc: Luqtaniri

source: Port
ayc: Punku

source: Password
ayc: Jamäsa chimpu:

source: Register
ayc: Qillqantawi chinu

source: Colors
ayc: Saminaka

source: Upload
ayc: Ch'amanchaña

source: Facebook wall post
ayc: Facebook sata qillqaña pirqapa

source: Upload to Web
ayc: Web wakichataru apayaña

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
ayc: Mantañataki wakichatama utjañapawa akana: http://turtleartsite.sugarlabs.org. Ukasti luraña amtawima apaqañatakiwa.

source: Username:
ayc: Apnaqirina sutipa:

source: Password:
ayc: Jamäsa chimpu:

source: Title:
ayc: Suti:

source: Description:
ayc: Jamuqawi:

source: Submit to Web
ayc: Web wakichataru apayaña

source: Cancel
ayc: Acht'ayaña

source: Login failed
ayc: Janicha jumäkta, pantjtiwa.

source: Failed to upload!
ayc: ¡Apaqkasina, pantjti!

source: The path to the TurtleArt installation must be listed in the environment variable PYTHONPATH.
ayc: TurtleArt wakichata utanuqayañataki thakixa PYTHONPATH sata taypinkañapawa.

source: Palette of flow operators
ayc: Thakipnama sarantayiri samik'ullu

source: while
ayc: ukch'añkama

source: do-while-True operator that uses boolean operators from Numbers palette
ayc: jakhunakataki samik'ulluna booleano sutini sarantayiripa apnaqiri do-while-True sata wakichata

source: until
ayc: ukakama

source: do-until-True operator that uses boolean operators from Numbers palette
ayc: jakhunakataki samik'ulluna booleano sutini sarantayiripa apnaqiri do-until-True sata wakichata

source: top
ayc: p'iqi patxa

source: top of a collapsible stack
ayc: lip'isiri pilana p'iqi patxapa

source: Palette of media objects
ayc: Taypinkiri t'aqana samik'ullupa

source: media
ayc: wakisiri thaki

source: journal
ayc: sapüru lurawi

source: Sugar Journal media object
ayc: Sugar satana Sapüru Lurawipana apnaqaña yäpa

source: audio
ayc: ist'asiwi

source: Sugar Journal audio object
ayc: Sugar satana Sapüru Lurawipana ist'asiwi yäpa

source: video
ayc: uñtaña

source: Sugar Journal video object
ayc: Sugar satana Sapüru Lurawipana uñtaña yäpa

source: description
ayc: jamuqawi

source: Sugar Journal description field
ayc: Sugar satana Sapüru Lurawipana jamuqawi yäpa

source: text
ayc: qillqata

source: string value
ayc: cadena sata yawriwiskana chanipa

source: show
ayc: uñachayaña

source: draws text or show media from the Journal
ayc: Sapüru Lurawi taypitha jamuqa sich'suña, janukaxa uka taypitha wakisirinaka uñachayaña

source: show aligned
ayc: siqichatanaka uñachayaña

source: set scale
ayc: tupu jithiraya chimpuña

source: sets the scale of media
ayc: medios sata wakichatanakana tupu jithiriyapa wakiyaña

source: set font
ayc: qillqana kastapa wakiyaña

source: sets the font used by the show block
ayc: uñstata t'aqana apnaqata qillqa wakiyaña

source: save picture
ayc: jamuqa imaña

source: picture name
ayc: jamuqana sutipa

source: saves a picture to the Sugar Journal
ayc: Sugarana Sapüru Lurawi Qillqaru aka jamuqa imma

source: save SVG
ayc: SVG wakichata imaña

source: saves turtle graphics as an SVG file in the Sugar Journal
ayc: Sugarana Sapüru Lurawi Qillqaparu SVG q'ipichjama, turtuwana sich'sutanakapa imma

source: scale
ayc: patapatacha

source: holds current scale value
ayc: patapatachana jichhachata chanipa katxäsiriwa

source: media wait
ayc: medios sata wakisirinaka suyaña

source: wait for current video or audio to complete
ayc: ist'aña, jani ukaxa, uñjaña wakichata tukuyañapkama suyaña

source: media stop
ayc: medios sata wakisirinaka acht'ayaña

source: stop video or audio
ayc: uñjaña, jani ukaxa, ist'aña wakichata acht'ayiriwa

source: media pause
ayc: medios sata akisirinaka suyt'ayaña

source: pause video or audio
ayc: uñjaña, jani ukaxa, ist'aña wakichata suyt'ayiriwa

source: media resume
ayc: medios sata wakisirinaka sarayaskakiña

source: resume playing video or audio
ayc: uñjaña, jani ukaxa, ist'aña wakichata wasitatha qalltayaña

source: speak
ayc: arsuña

source: hello
ayc: kamisaraki

source: speaks text
ayc: qillqataxa siwa

source: sinewave
ayc: sinusoide wakichata

source: pitch
ayc: frecuencia sata wakichatanaka thaqaña

source: amplitude
ayc: amplitud sata

source: duration
ayc: qhanawi

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
ayc: frecuencia satatha, amplitud satatha, duración sata qhanäwitha, sinusoide sarantayi (ch'ipxtathkama jakt'ata)

source: Palette of sensor blocks
ayc: Katjiri t'aqana samik'ullupa

source: sensor
ayc: katjiri

source: button down
ayc: limxatata limt'aña

source: returns 1 if mouse button is pressed
ayc: achakuna limiñapa limxatatïpanxa, 1 jakhuruwa kutt'ayi

source: returns True if mouse button is pressed
ayc: achakuna limiñapa limxatatïpanxa, Chiqapawa sasawa kutt'ayi

source: mouse x
ayc: achakuna x luqt'iripa

source: returns mouse x coordinate
ayc: achakuna x coordinada wakichatapa kutt'ayiriwa

source: mouse y
ayc: achakuna y luqt'iripa

source: returns mouse y coordinate
ayc: achakuna y coordinada wakichatapa kutt'ayiriwa

source: query keyboard
ayc: t'iqiqiyañatha yatxataña

source: query for keyboard input (results stored in keyboard block)
ayc: t'iqiqiyañana mantañapatha yatxataña (luraña tukuyatanakaxa t'iqiqiyañana t'aqaparu imatawa)

source: keyboard
ayc: t'iqiqiyaña

source: holds results of query-keyboard block as ASCII
ayc: ASCII wakichatjama t'iqiqiyaña uñakipawina t'aqapana tukuyatanakapaniwa

source: read pixel
ayc: pixel wakichata ullaña

source: RGB color under the turtle is pushed to the stack
ayc: turtuwa aynacharu, RGB samiwa pilaru apayasi

source: turtle sees
ayc: turtuwaxa uñjiwa

source: returns the color that the turtle "sees"
ayc: turtuwana "uñjatapa" sami uñachayi

source: time
ayc: pacha

source: elapsed time (in seconds) since program started
ayc: pacha sarawi (ch'ipxtanaka jakt'asa), wakicht'awi qalltathpacha

source: Palette of extra options
ayc: Juk'ampi wakichawini samik'ullu

source: extras
ayc: yaqhanakampi

source: push
ayc: limt'aña

source: pushes value onto FILO (first-in last-out heap)
ayc: FILO sata arkuru aka chani arkt'ma (mantañanxa, nayraqata; mistuñanxa, qhipa)

source: show heap
ayc: pila sata arkuchawi uñachayma

source: shows values in FILO (first-in last-out heap)
ayc: FILO sata arkuru chanichatanaka uñachayma (mantañanxa, nayraqata; mistuñanxa, qhiparaki)

source: empty heap
ayc: pila sata arku ch'usaptayaña

source: emptys FILO (first-in-last-out heap)
ayc: FILO sata arku ch'usaptayma (mantañanxa, nayraqata; mistuñanxa, qhiparaki).

source: pop
ayc: apsuña

source: pops value off FILO (first-in last-out heap)
ayc: FILO sata arkuna chanipa apsma (mantañanxa, nayraqata; mistuñanxa, qhiparaki)

source: empty heap?
ayc: ¿pila sata arkuxa ch'usati?

source: returns True if heap is empty
ayc: arkutixa ch'usächixa, Chiqapawa sasawa kutt'ayi.

source: save heap to file
ayc: qillqa q'ipicharu arkuchata imaña

source: filename
ayc: q'ipichana sutipa

source: saves FILO (first-in last-out heap) to a file
ayc: FILO sata ARKU imaña (mantañanxa, nayraqata; mistuñanxa, qhiparaki)

source: load heap from file
ayc: q'ipichana arkupa phuqt'ayma

source: loads FILO (first-in last-out heap) from a file
ayc: FILO sata ARKU phuqt'ayma (mantañanxa, nayraqata; mistuñanxa, qhiparaki), maya q'ipichatha apsusa

source: comment
ayc: amuyt'asa arst'aña

source: places a comment in your code
ayc: wakisiri chimpumaru maya amuyt'awima qillqantma

source: print
ayc: laphiru liq'suña

source: prints value in status block at bottom of the screen
ayc: pantallana aynachaparu, bloque de estado sataru, chani, laphiru liq'sma

source: Python chr operator
ayc: Python satana chr sarantayiripa

source: Python int operator
ayc: Python int satana sarantayiripa

source: polar
ayc: polar sata

source: displays polar coordinates
ayc: coordenadas polares wakichatanaka uñachayma

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
ayc: maya wakichawichaña t'aqa: akasti ch'amjama ecuaciones matemáticas satampi yapxatañatakiwa; sañäni, seno(x), sasa

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
ayc: maya wakichawichaña t'aqa: akasti walja mayjt'ayirini ch'ama ecuaciones matemáticas satampi yapxatañatakiwa; sañäni, sqrt(x*x+y*y), sasa

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
ayc: maya wakichañachaña t'aqa: akasti walja mayjt'ayirini sinti ch'ama ecuaciones matemáticas satampi yapxatañatakiwa; sañäni, seno(x+y+z), sasa

source: Cartesian
ayc: Cartesiana wakichata

source: displays Cartesian coordinates
ayc: coordenadas cartesianas satanaka uñachayixa

source: Python block
ayc: Python sata t'aqa

source: runs code found in the tamyblock.py module found in the Journal
ayc: Sapüru Lurawi qillqatankiri módulo tamyblock.py satana kuriwu chimpupa sarantayi

source: gets a text string or an image from a URL
ayc: URL sata taypitha, qillqata, januka jamuqa chint'atanaka kamañataki

source: turtle shell
ayc: turtuwana ch'aka lip'ichipa

source: put a custom 'shell' on the turtle
ayc: turtuwaru, mä ch'aka lip'ichipa alljt'asina, isintayaña

source: turtle
ayc: turtuwa

source: chooses which turtle to command
ayc: apnaqañataki turtuwa ajllt'ma

source: turtle x
ayc: turtuwa x

source: Returns x coordinate of turtle
ayc: Turtuwatha, coordenada x sata kutsuyi

source: turtle y
ayc: turtuwa y

source: Returns y coordinate of turtle
ayc: Turtuwatha, coordenada y sata kutsuyi

source: active turtle
ayc: turtuwa uñanaqaskiwa

source: the name of the active turtle
ayc: uñanaqkiri turtuwana sutipa

source: turtle heading
ayc: turtuwana thakipa

source: Returns heading of turtle
ayc: Turtuwana thakipa kutt'ayi

source: click to open
ayc: wakichata llawirañataki kliktaya limt'aña

source: top of a collapsed stack
ayc: allimuktirjama arkuna p'iqi patxapa

source: select palette
ayc: samik'ullu ajlliña

source: selects a palette
ayc: maya samik'ullu ajllt'ma

source: load
ayc: ch'amanchaña

source: forward
ayc: nayräxa tuqiru

source: loads a block
ayc: maya t'aqa ch'amanchma

source: setxy
ayc: xy chimpu wakichaña

source: index
ayc: utjirinaka

source: return the text of the positions
ayc: uka kikipatha qillqata kutsuyaña

source: string
ayc: yawriwiska

source: start
ayc: qalltaña

source: end
ayc: tukuya

source: Palette of presentation templates
ayc: Uñstayawi palantillana samik'ullupa

source: portfolio
ayc: qillqach'uspa

source: hide blocks
ayc: t'aqanaka imantaña

source: declutters canvas by hiding blocks
ayc: t'aqanaka imantasina, samipañu q'umachma

source: show blocks
ayc: t'aqanaka uñachayaña

source: restores hidden blocks
ayc: imantata t'aqanaka askicht'ma

source: hides the Sugar toolbars
ayc: Sugarana Lurañataki yänakapa imantma

source: list
ayc: lista sata aytawi

source: presentation bulleted list
ayc: jamuqalla aytawimpi uñt'ayaña

source: presentation template: list of bullets
ayc: uñt'ayawi palantilla: jamuqalla aytawi

source: presentation template: select Journal object (no description)
ayc: uñt'ayawi palantilla: Sapüru lurawina yäpa ajlliña (jani jamuqawini)

source: presentation template: select Journal object (with description)
ayc: uñt'ayawi palantilla: Sapüru lurawina yäpa ajlliña (jamuqawini)

source: presentation template: select four Journal objects
ayc: uñt'ayawi palantilla: Sapüru lurawina pusi yäpa ajlliña

source: presentation template: select two Journal objects
ayc: uñt'ayawi palantilla: Sapüru lurawina paya yäpa ajlliña

source: left
ayc: ch'iqa

source: xcor of left of screen
ayc: pantallana ch'iqa tuqipankiri xcor sata

source: bottom
ayc: manqha

source: ycor of bottom of screen
ayc: pantallana aynacha tuqipankiri ycor sata

source: width
ayc: lankhu

source: the canvas width
ayc: samipañuna lankhupa

source: right
ayc: kupi

source: xcor of right of screen
ayc: pantallana kupïxapankiri xcor sata

source: ycor of top of screen
ayc: pantallana patxäxapankiri ycor sata

source: height
ayc: sayt'a

source: the canvas height
ayc: samipañuna sayt'apa

source: title x
ayc: x p'iqinchiri suti

source: title y
ayc: y p'iqinchiri suti

source: left x
ayc: x ch'iqa

source: top y
ayc: y alaya

source: right x
ayc: x kupi

source: bottom y
ayc: y aynacha

source: Palette of user-defined operators
ayc: Apnaqirina wakichata luraña samik'ullupa

source: my blocks
ayc: t'aqanakaja

source: brightness
ayc: lliphi

source: light level detected by camera
ayc: kamarana katjata qhanana tupupa

source: camera output
ayc: kamarana mistuña punkupa

source: Average RGB color from camera is pushed to the stack
ayc: Pila arku tuqiru sartiri kamarana RGB samipana chikpurachapa

source: read value from RFID device
ayc: radiofrecuencia (RFID) wakichatanaka thaqaña chanipa ullaña

source: acceleration
ayc: jank'achata tupuña

source: push acceleration in x, y, z to heap
ayc: pila sata arkuna, x, y, z uka chiqanakaruwa jank'achawi uchixa

source: light level detected by light sensor
ayc: katjirina katjata qhanana tupupa

source: sound
ayc: salla

source: raw microphone input signal
ayc: mijruphununa mantañapana chimpupa

source: loudness
ayc: sallanchiri

source: microphone input volume
ayc: mijruphununa mantañapana sallanchiripa

source: microphone input pitch
ayc: mijruphununa mantañapana frecuencia satapa

source: resistance
ayc: ch'amanchawi

source: microphone input resistance
ayc: mijruphununa mantañapana ch'amanchawipa (rango de medición: 700 a 14000 ohms)

source: voltage
ayc: wultaji

source: microphone input voltage
ayc: mijruphununa mantañapana DC wultajina chanipa (rango de medición: 700 a 14000 ohms)

source: uturn
ayc: U uñanaqaru muytaña

source: turns the turtle 180 degrees
ayc: 180 grados ukakama, turtuwa muytayaña

source: Please install the Speak Activity and try again.
ayc: Mira suma, Arsuña Lurawi utanuqayma, ukatha mayampisa yant'askakma.

source: Spanish
ayc: Kastillanu aru

source: English
ayc: Inglés aru

source: Sorry, I can't understand what you are asking about.
ayc: Jichhaxa kamacharakiñänisti, jiskht'atama janiwa suma katuqsmati.

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
ayc: Jichhaxa kamacharakiñäni, laxwijaxa phuqantatäxiwa. Yaqha lurawinaka ist'antma, ukatha mayampi yant'ma.

source: other
ayc: yaqhanaka

source: push destination rgb value to heap
ayc: pila sata arkuru rgb chanipa arkuchma.

source: stop
ayc: acht'ayaña

source: play
ayc: qhantayaña

source: save
ayc: imaña

source: did not output to
ayc: janiwa akaru qillqañjamäkiti

source: doesn't like
ayc: janiwa khusäkiti chuymapatakixa

source: as input
ayc: mantañatakjama

source: I don't know how to
ayc: Janiwa kunjama lurañsa yatkthti

source: usage is
ayc: lurañaxa akhamawa

source: No option action:
ayc: Kunaymanatha lurañaxa janiwa utjiti:

source: File not found
ayc: Laphi q'ipixa chhaqatawa.

source: Configuration directory not writable: %s
ayc: Jani unuqiyaña askichawi qillqa chinu: %s

source: New
ayc: Machaqa

source: Show sample projects
ayc: Yatikipañataki yaqha luraña amtawinaka uñachayaña

source: Save as
ayc: ¿Kuna sutinsa imantaxa?

source: Export as
ayc: ¿Kuna wakichatjamsa apt'ayantaxa?

source: image
ayc: jamuqa

source: icon
ayc: Jamuqa chimpu

source: Quit
ayc: Mistsuña

source: File
ayc: Laphi q'ipi

source: Rescale coordinates
ayc: Coordenadas wakichatanaka jithsrayaña

source: Reset block size
ayc: T'aqana tañapa wasitatha luraña

source: Show/hide blocks
ayc: T'aqanaka uñachayaña/imantaña

source: Tools
ayc: Lurañataki yänaka

source: Debug
ayc: Jaqsraña

source: Turtle
ayc: Turtuwa

source: Plugins
ayc: Plugins Phuqanchañanaka

source: About...
ayc: ...uka tuqitha

source: You have unsaved work. Would you like to save before quitting?
ayc: Jumana jani imata irnaqawimawa utji. ¿Jichhaxa, janirja mistkasina, imasiña muntati?

source: Save project?
ayc: ¿Aka luraña amtawixa imañati?

source: Plugin %s already installed
ayc: Plugin %s ukaxa utanuqatäxiwa.

source: myproject
ayc: luraña amtawija

source: Please restart %s in order to use the plugin.
ayc: Plugin wakichatampi sarañataki mayampi qhantayma.

source: Please restart %s in order to unload the plugin.
ayc: Plugin wakichatata mistuñataki mayampi qhantayma %s.

source: displays next palette
ayc: arkiri samik'ullu uñachayma

source: changes the orientation of the palette of blocks
ayc: t'aqanakana samik'ullupa sarañapa jaqukipma

source: trash
ayc: jani wakisiri imaña

source: block is not exportable
ayc: t'aqaxa janiwa yaqhawjaru apsuñjamäkiti

source: error while exporting block
ayc: t'aqa yaqhawjaru apaykasa pantjata

source: error in highlighted block
ayc: wali qhananchata t'aqanxa pantjatawa utji

source: error
ayc: pantjata

source: orientation
ayc: kawksa tuqi

source: next
ayc: arkiri

source: shift
ayc: jaqsuña

source: Please hit the Stop Button before making changes to your program
ayc: Mira suma, janirja wakicht'ataru mayjt'ayawinaka lurkasina, Acht'ayaña sata limiña limt'ma

source: action
ayc: lurawi

source: my box
ayc: kajunaja

source: Select blocks to share
ayc: Khitinakaru t'uqiyañataki t'aqanaka ajllt'ma

source: Really overwrite stack?
ayc: ¿Pila sata arku wakichataru qillqxataña muntati?

source: Overwrite stack
ayc: Pila sarta arku wakichataru qillqxataña

source: Really delete stack?
ayc: ¿Pila sata arkuwakichata chhaqtayaña muntati?

source: empty trash
ayc: jani wakisiri imatanaka q'ala chhaqtayaña

source: Do you really want to empty the trash?
ayc: ¿Chiqapuniti jani wakisiri imañankiri yänaka chhaqtayaña munta?

source: Cannot write data to %s.
ayc: Janiwa kunasa qillqaskasphasti akaruxa: %s.

source: Please choose a different save directory.
ayc: Mirá, kunaymanatha qillqa chinu imaña ajllma.

source: Please choose a different file name.
ayc: Mirá, yaqha qillqa q'ipichana sutipa ajllt'ma.

source: heading
ayc: kawksarusa

source: shade
ayc: ch'iwucha

source: gray
ayc: uqi

source: color
ayc: sami

source: True
ayc: Chiqapa

source: False
ayc: K'ari

source: invokes named action stack
ayc: sutinchata luraña arkuru jawsaña

source: named variable (numeric value)
ayc: qhanstayata mayjt'ayiri (jakhu chani)

source: store in
ayc: kawkjarusa imaña

source: value
ayc: chani

source: stores numeric value in named variable
ayc: qhanstayata mayjt'iriru jakhu chani imma

source: Plugin could not be installed.
ayc: Plugin wakichataxa janiwa utantayañjamäkiti.

source: up
ayc: alaxa

source: down
ayc: aynacha

source: backspace
ayc: qhipäxaru jitht'aña

source: tab
ayc: jitt'ayiri

source: enter
ayc: aynacharu

source: space
ayc: ch'usawja

source: delete
ayc: chhaqtayaña

source: Title
ayc: P'iqinchiri

source: banana
ayc: puquta

source: Load...
ayc: Ch'amanchaña...

source: Save...
ayc: Imaña...

source: Palette of turtle commands
ayc: Turtuwana chiqachiri samik'ullupa

source: moves turtle forward
ayc: naräxaru turtuwa jithtayma

source: back
ayc: qhipäxa

source: moves turtle backward
ayc: qhipäxaru turtuwa jitt'ayma

source: clean
ayc: pichsuña

source: clears the screen and reset the turtle
ayc: pantalla phichsma, ukatha turtuwa mayampi wakicht'asiyma

source: turns turtle counterclockwise (angle in degrees)
ayc: turtuwa kut'tayma ch'iqa amparama tuqiru (ángulo de grados).

source: turns turtle clockwise (angle in degrees)
ayc: turtuwa jitt'ayma kupi amparama tuqiru (ángulo de grados)

source: arc
ayc: kürmicha

source: angle
ayc: pallqa

source: radius
ayc: raryu

source: moves turtle along an arc
ayc: turtuwa kürminama jithikipayma

source: set xy
ayc: xy wakt'ayaña

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
ayc: xcor, ycor ukjaru turtuwa unxtayma; (0, 0) uka panipa jakhuxa pantalla chika taypinkiwa.

source: set heading
ayc: thakipa wakt'ayaña

source: sets the heading of the turtle (0 is towards the top of the screen.)
ayc: turtuwana kawki tuqiru sarañapa wakiyma (0 sata ch'usa jakhuxa pantallanxa patawxankiwa.)

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
ayc: turtuwana jichha x sata siqichapaniwa (mä jakhu t'aqa lantisa apnaqasisphawa)

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
ayc: turtuwana jichha y sata siqichapaniwa (mä jakhu t'aqa lantisa apnaqasisphawa)

source: holds current heading value of the turtle (can be used in place of a number block)
ayc: turtuwana kawki tuqiru jichha sarañapaniwa (mä jakhu t'aqa lantisa apnaqasisphawa)

source: Palette of pen commands
ayc: Sich'iñana kamachipana samik'ullupa

source: pen
ayc: phuyu

source: fill screen
ayc: pantalla phuqantaña

source: fills the background with (color, shade)
ayc: manqhäxapa samimpisa ch'iwumpisa phuqantaña

source: set color
ayc: sami wakt'ayaña
