Repository: Kiy4h/TortugadeMexico
Catalog: po/ayc.po
Languages: ayc

source: sets color of the line drawn by the turtle
ayc: turtuwa jamuqaski uka sich'ina samipa wakt'ayma

source: set shade
ayc: ch'iwucha wakt'ayaña

source: sets shade of the line drawn by the turtle
ayc: turtuwa jamuqki uka sich'ina ch'iwuchiri samipa wakt'ayma

source: set gray
ayc: uqi sami wakt'ayaña

source: sets gray level of the line drawn by the turtle
ayc: turtuwaxa jamuqki uka sich'ina uqi samini kankañapa wakiyma

source: holds current pen color (can be used in place of a number block)
ayc: phuyuna anchha samipaniwa (maya jakhu t'aqa lantisa apnaqasisphawa)

source: holds current pen shade
ayc: phuyuna anchha ch'iwuchiri samipaniwa

source: holds current gray level (can be used in place of a number block)
ayc: uqiru samiri jichhachata tupuniwa (maya jakhu t'aqa lantisa apnaqasisphawa)

source: pen up
ayc: phuyu alaxaru jithsuyaña

source: Turtle will not draw when moved.
ayc: Turtuwaxa, unxtani ukjaxa, janiwa sich'kaniti.

source: pen down
ayc: sich'iña phuyu manqharu jithiqaña

source: Turtle will draw when moved.
ayc: Turtuwaxa, unxtasaxa, sich'iniwa.

source: pen down?
ayc: ¿jayphu phuyu?

source: returns True if pen is down
ayc: sich'iri phuyuxa jayphüchixa, Chiqapa kutsuyma

source: set pen size
ayc: tañapa wakt'ayaña

source: sets size of the line drawn by the turtle
ayc: turtuwaxa sich'ki uka sich'ina lankhupa wakiyma

source: start fill
ayc: phuqt'ayaña qalltaña

source: starts filled polygon (used with end fill block)
ayc: puliwunu phuqantaña qallantaña (t'aqana phuqasitapa tukuyañampi apnaqatawa)

source: end fill
ayc: samichasa phuqachaña tukuyaña

source: completes filled polygon (used with start fill block)
ayc: phuqachasiri puliwunu phuqachaña tukxatayma (t'aqana phuqasitapa tukuyañampi apnaqatawa)

source: pen size
ayc: sich'iri phuyuna tañapa

source: holds current pen size (can be used in place of a number block)
ayc: phuyuna jichhachata tañapaniwa (mä jakhu t'aqa lantisa apnaqasisphawa)

source: Palette of pen colors
ayc: Samichiri phuyunakana samik'ullupa

source: colors
ayc: saminaka

source: red
ayc: chupika

source: orange
ayc: laranja q'illu

source: yellow
ayc: q'illu

source: green
ayc: ch'uxña

source: cyan
ayc: larama ch'uxña

source: blue
ayc: larama

source: purple
ayc: kulli, ch'imaxa

source: white
ayc: janq'u

source: black
ayc: ch'iyara

source: Palette of numeric operators
ayc: Jakhunaka sarantayiri samik'ullu

source: numbers
ayc: jakhunaka

source: plus
ayc: jakhuxataña

source: adds two alphanumeric inputs
ayc: qillqajakhuna paya mantapa jakhuthapma.

source: minus
ayc: jakhuqa

source: subtracts bottom numeric input from top numeric input
ayc: alaxa jakhuna mantapatha aynacha jakhuna mantapa jakhuqma

source: multiply
ayc: mirayaña

source: multiplies two numeric inputs
ayc: panini jakhunakana mantapa mirayma

source: divide
ayc: jakhjaña

source: divides top numeric input (numerator) by bottom numeric input (denominator)
ayc: alaya jakhunakana mantapa (jakhjata) aynacha jakhunakana mantaparu (jakhjiri) uñtasa jakhjma

source: identity
ayc: sutini kankaña

source: identity operator used for extending blocks
ayc: t'aqanaka jithitatayañataki, apnaqata sutini kankañana sarantayiripa

source: modular (remainder) operator
ayc: mod apnaqiri (jilt'a)

source: square root
ayc: raíz cuadrada

source: calculates square root
ayc: raíz cuadrada apsma

source: random
ayc: kawkïrïphasa

source: returns random number between minimum (top) and maximum (bottom) values
ayc: alaxankiri juk'achata chanimpitha aynacha jilachata chanimpitha kawkïri jakhsa kutiyaskakma

source: number
ayc: jakhu

source: used as numeric input in mathematic operators
ayc: matimatika sarantayirina, jakhu mantjama apnaqata

source: greater than
ayc: ...ukatha sipana jilawa

source: logical greater-than operator
ayc: ukatha sipana jilawa sasa chaninchiri

source: less than
ayc: ...ukatha sipana pisiwa

source: logical less-than operator
ayc: ukatha sipana pisiwa sasa chaninchiri

source: equal
ayc: ukjapura

source: logical equal-to operator
ayc: ukjapurawa sasa chaninchiri

source: not
ayc: janiwa

source: logical NOT operator
ayc: JANI sasa chaninchiri

source: and
ayc: ukampi

source: logical AND operator
ayc: UKAMPI sasa chaninchiri

source: or
ayc: januka

source: logical OR operator
ayc: JANUKA sasa chaninchiri

source: flow
ayc: laya

source: wait
ayc: suyt'aña

source: pauses program execution a specified number of seconds
ayc: ch'ipxtanaka jakht'asina wakicht'awina sarañapa acht'ayiriwa

source: forever
ayc: wiñayataki

source: loops forever
ayc: wiñayataki kutxataña

source: repeat
ayc: kutxataña

source: loops specified number of times
ayc: qhawqha kuti kutxatama sisa uka kutxatma

source: if
ayc: ukatixa...

source: then
ayc: ukhamaxa

source: if then
ayc: ukatixa ukhamaxa

source: if-then operator that uses boolean operators from Numbers palette
ayc: ukatixa-ukhamaxa sata chaninchirixa Jakhunakana pallallk'ullupana chaninchirinakapawa

source: else
ayc: jani ukaxa

source: if then else
ayc: ukatixa-ukhamaxa-jani ukaxa

source: if-then-else operator that uses boolean operators from Numbers palette
ayc: ukatixa-ukhamaxa-jani ukaxa sata chaninchirixa Jakhunakana pallallk'ullupana chaninchirinakapawa.

source: horizontal space
ayc: irama pampa

source: jogs stack right
ayc: kupiwxaru pila sata arku jithjtayma

source: vertical space
ayc: wira pampa

source: jogs stack down
ayc: aynachawxaru pila sata arku jithjtayaña

source: stop action
ayc: lurawi acht'ayaña

source: stops current action
ayc: jichha lurawi acht'ayi

source: Palette of variable blocks
ayc: Kunaymana mayjt'ayirinakana t'aqapana samik'ullupa

source: blocks
ayc: t'aqanaka

source: connects action to toolbar run buttons
ayc: luraña yänaka sarantayaña limt'añanakampiwa lurawinaka qhantayma

source: top of nameable action stack
ayc: sutiyañjama lurawina arkupana p'iqipa

source: store in box 1
ayc: 1 jakhuni kajunaru imaña

source: stores numeric value in Variable 1
ayc: 1 jakhuni mayjt'ayiriru, aka jakhuna chanipa imma.

source: store in box 2
ayc: 2 jakhuni kajunaru imaña

source: stores numeric value in Variable 2
ayc: 2 jakhuni mayjt'ayiriru, aka jakhuna chanipa imma.

source: box 1
ayc: 1 jakhuni kajuna

source: Variable 1 (numeric value)
ayc: 1 jakhuni mayjt'ayiri (jakhu chanipa)

source: box 2
ayc: 2 jakhuni kajuna

source: Variable 2 (numeric value)
ayc: 2 jakhuni mayjt'ayiri (jakhu chanipa)

source: box
ayc: kajuna

source: action 1
ayc: 1 lurawi

source: top of Action 1 stack
ayc: 1 Luräwina arkupana nayrïripa

source: action 2
ayc: 2 lurawi

source: top of Action 2 stack
ayc: 2 Lurawina arkupana nayrïripa

source: invokes Action 1 stack
ayc: 1 jakhuni Lurawi arkuru jawsayaña

source: invokes Action 2 stack
ayc: 2 jakhuni Lurawi arkuru jawsayaña

source: invokes named action stack and returns value
ayc: sutichata lurawi arku jawsi, chanipsa kutuyarakiwa

source: return
ayc: kutt'aña

source: returns a value
ayc: nhani kutt'ayaña

source: permanently deletes items in trash
ayc: jani wakisiri imañatha, yänaka sapa kuti pichsma

source: restore all
ayc: taqpacha wasitatha jaktayaña

source: restore all blocks from trash
ayc: jani wakisiri imañankiritha, taqpacha t'aqanaka wasitatha jaktayma

source: clear all
ayc: taqpacha chhaqtayaña

source: move all blocks to trash
ayc: q'alpacha t'aqanaka jani wakisiri imañaru uskuntma
