Repository: Kiy4h/TortugadeMexico
Catalog: po/gug.po
Languages: gug

source: TurtleBlocks
gug: tortublock kuera

source: Please wait
gug: ﻿Rehe pytyvõ oha'arõ

source: Starting connection...
gug: iniciando joapy . . .

source: Export as python
gug: ﻿Mondo akaru python

source: Error: You must use a Start Block when exporting to Python.
gug: error: ova'erã kuera puru peteĩ bloque empezar ave omondo kuera pythonpe.

source: snapshot
gug: instantánea

source: Turn off hover help
gug: ﻿Deshabilitar oipytyvõ ovevúiva

source: Turn on hover help
gug: ﻿ mbosako'i oipytyvõ ovevúiva

source: Show palette
gug: ﻿ hechauka paleta

source: Hide palette
gug: ﻿ mo'ã paleta

source: Show blocks
gug: ﻿ hechauka bloque kuera

source: Hide blocks
gug: ﻿ mo'ã bloque kuera

source: Rescale coordinates down
gug: ﻿ jupijupi coordenada kuera kotyo yvýpe

source: Rescale coordinates up
gug: ﻿ jupijupi coordenada kuera kotyo yvate

source: Edit
gug: Editar

source: View
gug: hecha

source: Copy
gug: kopia

source: Paste
gug: nupã

source: Restore blocks from trash
gug: ﻿ restaura bloque kuera papelera

source: Save stack
gug: ﻿ ñongatu aty

source: Delete stack
gug: ﻿ mbogue aty

source: Fullscreen
gug: ﻿ tenda jepyso ohechaukáva ta'anga ojapopa

source: Cartesian coordinates
gug: ﻿ coordenada kuera cartesiana kuera

source: Polar coordinates
gug: ﻿ coordenada kuera polar kuera

source: Metric coordinates
gug: ﻿ coordenada kuera centímetro kuera

source: Grow blocks
gug: ﻿ mbotuicha bloque kuera

source: Shrink blocks
gug: ﻿ empequeñecer bloque kuera

source: Load example
gug: ﻿ hupi techapyrã kuera

source: Save/Load
gug: Guardar/Cargar

source: Project
gug: Proyecto

source: Clean
gug: ﻿ mopotĩ

source: Run
gug: ﻿ japo

source: Step
gug: ﻿ me'ẽ peteĩ ahasa

source: Stop turtle
gug: ﻿ pyta karumbe

source: Help
gug: oipytyvõ

source: Stop
gug: pyta

source: Share selected blocks
gug: ﻿ mboja'o bloque kuera seleccionado kuera

source: Save as image
gug: ﻿ ñongatu akaru ta'anga

source: Save as icon
gug: ﻿ ñongatu akaru icono

source: Save as ODP
gug: ﻿ ñongatu akaru odp

source: Save as Logo
gug: ﻿ ñongatu akaru logo

source: Save as Python
gug: ﻿ ñongatu akaru python

source: Save snapshot
gug: ﻿ ñongatu instantánea

source: Add project
gug: ﻿ mbojo'a proyecto

source: Load plugin
gug: ﻿ hupi plugin

source: Load Python block
gug: ﻿ hupi bloque python

source: Palettes
gug: ﻿ paleta kuera

source: Sharing blocks disabled
gug: ﻿ mboja'o bloque kuera deshabilitado

source: Save
gug: ñongatu

source: Save blocks as image
gug: ﻿ ñongatu bloque kuera akaru ta'anga

source: Load
gug: ﻿ hupi

source: Open
gug: mboty'o

source: Plugin %s already installed.
gug: ﻿ pe plugin %s kuera ojeojuhu instalado. ma

source: Do you want to reinstall %s?
gug: ﻿¿oipota reinstalar %s kuera?

source: My Turtle Art session
gug: ﻿ che sesión tortugarte mba'e

source: Enable collaboration
gug: ﻿ moneĩ pe ñepytyvõ

source: Activities
gug: ﻿ actividade kuera

source: Buddies
gug: ﻿ angirũ kuera

source: Share
gug: mboja'o

source: Configuration
gug: Configuración

source: Neighborhood
gug: amandaje

source: Nickname
gug: hero

source: Account ID
gug: ﻿ jepaga arã kuatia

source: Server
gug: Servidor

source: Port
gug: ﻿ ygarupa

source: Password
gug: Contraseña

source: Register
gug: ﻿ téra ryru

source: Colors
gug: ﻿ sa'y kuera

source: Upload
gug: hupi

source: Facebook wall post
gug: ﻿ okyke facebook mba'e

source: Upload to Web
gug: ﻿ mondo lape web

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
gug: ova'erã mombe'u peteĩ ndive jepaga arã kuatia http://turtleartsite.sugarlab kuera.org opyta guejy iproyecto me/pe

source: Username:
gug: oiporúva peteĩ mba'e

source: Password:
gug: Contraseña

source: Title:
gug: Contraseña

source: Description:
gug: ﻿ descripción:

source: Submit to Web
gug: Enviar a la Web

source: Cancel
gug: Cancelar

source: Login failed
gug: ﻿ jejavy autentificación mba'e

source: Failed to upload!
gug: ﻿ jejavy pe mboguejy !

source: The path to the TurtleArt installation must be listed in the environment variable PYTHONPATH.
gug: La ruta a la instalación de TurtleArt debe estar listada en la variable de entorno PYTHONPATH.

source: Palette of flow operators
gug: ﻿ paleta operador kuera mba'e syry

source: while
gug: jave

source: do-while-True operator that uses boolean operators from Numbers palette
gug: ﻿ ojeojapo pe serie accion kuera mba'e siguiente kuera pe bloque jave ojecumpla pe teko fijada pe ñepyrũ ete gua

source: until
gug: peve

source: do-until-True operator that uses boolean operators from Numbers palette
gug: ﻿ ojeojapo pe serie bloque kuera mba'e siguiente kuera peve hina ojecumpla pe teko

source: top
gug: ﻿ tu'ã

source: top of a collapsible stack
gug: ﻿ tu'ã peteĩ mba'e aty plegable

source: Palette of media objects
gug: ﻿ paleta bloque kuera mba'e amombyte kuera

source: media
gug: ﻿ amombyte kuera

source: journal
gug: ﻿ kuatiahaipyre

source: Sugar Journal media object
gug: ﻿ mba'e amombyte kuera mba'e kuatiahaipyre gua sugar

source: Sugar Journal audio object
gug: ﻿ mba'e audio mba'e kuatiahaipyre gua sugar

source: Sugar Journal video object
gug: ﻿ mba'e video mba'e kuatiahaipyre gua sugar

source: description
gug: ﻿ ñemombe'upaite

source: Sugar Journal description field
gug: ﻿ ñu ñemombe'upaite mba'e kuatiahaipyre gua sugar

source: text
gug: texto

source: string value
gug: ﻿ py'aguasu itasã mba'e

source: show
gug: hechauka

source: draws text or show media from the Journal
gug: ﻿ ha'ãngahai texto o hechauka amombyte kuera guive pe kuatiahaipyre

source: show aligned
gug: ﻿ hechauka mbohysýiva/papyre kuera

source: set scale
gug: ﻿ moĩ jupijupíva

source: sets the scale of media
gug: ﻿ moĩ pe jupijupíva amombyte kuera mba'e

source: set font
gug: ﻿ establecer fuente

source: sets the font used by the show block
gug: ﻿ establece pe fuente porupyre rehe pe bloque hechauka

source: save picture
gug: ﻿ ñongatu ta'anga

source: picture name
gug: ﻿ téra ta'anga

source: saves a picture to the Sugar Journal
gug: ﻿ oñongatu peteĩ ta'anga pe kuatiahaipyre asuka mba'e me/pe

source: save SVG
gug: ﻿ téra ta'anga

source: saves turtle graphics as an SVG file in the Sugar Journal
gug: ﻿ oñongatu gráfico kuera karumbe akaru peteĩ ñongatuha svg pe kuatiahaipyre asuka mba'e me/pe

source: scale
gug: jupijupíva

source: holds current scale value
gug: ﻿ omongaru pe py'aguasu ko'ãgagua jupijupíva

source: media wait
gug: ﻿ ha'arõ amombyte kuera

source: wait for current video or audio to complete
gug: ﻿ ﻿ ha'arõ amombyte kuera

source: media stop
gug: ﻿ pyta amombyte kuera

source: stop video or audio
gug: ﻿ pyta amombyte kuera

source: media pause
gug: ﻿ pausar amombyte kuera

source: pause video or audio
gug: ﻿ pa'ũ pe video o audio

source: media resume
gug: ﻿ japo mante amombyte kuera

source: resume playing video or audio
gug: ﻿ reanudar pe reproducción video mba'e o audio

source: speak
gug: ñe'ẽ

source: hello
gug: ﻿ maitei

source: speaks text
gug: ﻿ he'i texto

source: sinewave
gug: ﻿ sinusoide

source: pitch
gug: frecuencia

source: amplitude
gug: amplitud

source: duration
gug: duración

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
gug: ﻿ reproduce peteĩ sinusoide guive frecuencia, amplitud ha duración ( mokõiha-2-/aravo'ive kuera) me/pe

source: Palette of sensor blocks
gug: ﻿ paleta bloque kuera mba'e sensor

source: button down
gug: ﻿ votõ presionado

source: returns 1 if mouse button is pressed
gug: retorna 1 si el botón del ratón está presionado

source: returns True if mouse button is pressed
gug: retorna 1 si el botón del ratón está presionado

source: mouse x
gug: ﻿ cursor x

source: returns mouse x coordinate
gug: ﻿ omyengovia pe coordenada x cursorgua

source: mouse y
gug: ﻿ cursor ha

source: returns mouse y coordinate
gug: ﻿ retorna pe coordenada ha cursorgua

source: query keyboard
gug: ﻿ ñeporandu teclado mba'e

source: query for keyboard input (results stored in keyboard block)
gug: ﻿ ñeporandu opyta pe jeikeha teclado mba'e ( resultado kuera peĩme almacenado kuera pe bloque tecladogua ) me/pe

source: keyboard
gug: teclado

source: holds results of query-keyboard block as ASCII
gug: ﻿ contiene resultado kuera bloquegua ñeporandu mba'e teclado akaru ascii

source: read pixel
gug: ﻿ moñe'ẽ pixel

source: RGB color under the turtle is pushed to the stack
gug: ﻿ ojeomondo lape aty pe sa'y rgb aguejy pe karumbe

source: turtle sees
gug: ﻿ pe karumbe ohecha

source: returns the color that the turtle "sees"
gug: muestra el color que "ve" la tortuga

source: time
gug: ﻿ ára

source: elapsed time (in seconds) since program started
gug: ﻿ pe ára transcurrido ( mokõiha-2-/aravo'ive kuera) guive pe inicio jejaporã gua me/pe

source: Palette of extra options
gug: paleta opcion kuera mba'e adicionale kuera

source: extras
gug: extra kuera

source: push
gug: mbojo'a

source: pushes value onto FILO (first-in last-out heap)
gug: ombyaty pe py'aguasu pe aty (peteĩha hasa , pahague se me/pe

source: show heap
gug: ﻿ hechauka aty

source: shows values in FILO (first-in last-out heap)
gug: ﻿ techarã py'aguasu kuera pe aty (peteĩha hasa , pahague se ) me/pe

source: empty heap
gug: ﻿ monandi aty

source: emptys FILO (first-in-last-out heap)
gug: ﻿ ﻿ nandi tai 'p' réra aty (peteĩha hasa , pahagueoje ) me/pe

source: pop
gug: ﻿ nohẽ

source: pops value off FILO (first-in last-out heap)
gug: ﻿ onohẽ pe py'aguasu aty (peteĩha hasa , pahague se ) me/pe

source: empty heap?
gug: ﻿ aty nandi ?

source: returns True if heap is empty
gug: ﻿ omyengovia ete pe aty oĩ nandi rõ

source: save heap to file
gug: ﻿ omyengovia ete pe aty oĩ nandi rõ

source: filename
gug: ﻿ téra ñongatuha mba'e

source: saves FILO (first-in last-out heap) to a file
gug: ﻿ oñongatu pe aty (peteĩha hasa , pahague se ) unpe ñongatuha me/pe

source: load heap from file
gug: ﻿ hupi aty ñongatuha mba'e

source: loads FILO (first-in last-out heap) from a file
gug: ﻿ ohupi peteĩ aty (peteĩha hasa , pahague se ) guive peteĩ ñongatuha me/pe

source: comment
gug: comentar

source: places a comment in your code
gug: ﻿ omoĩ peteĩ comentario nde código me/pe

source: print
gug: ﻿ imprimir

source: prints value in status block at bottom of the screen
gug: ﻿ imprime pe py'aguasu pe bloque pokatuenda mba'e pe osẽ inferior tenda jepyso ohechaukáva ta'anga me/pe

source: Python chr operator
gug: Operador chr de Python

source: Python int operator
gug: ﻿ operador int python mba'e

source: displays polar coordinates
gug: ﻿ techarã coordenada kuera polar kuera

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
gug: ﻿ peteĩ bloque programable: puruva/papyre opyta mbojo'a ecuacion kuera matemática kuera avanzada kuera peteĩ mba'e hendave'ỹ , p.e. , pyti´a (x)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
gug: peteĩ bloque programable: puruva/papyre opyta mbojo'a ecuacion kuera matemática kuera avanzada kuera hetaichagua kuera mba'e hendave'ỹ kuera, i.e. , sqrt(x*x ha

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
gug: peteĩ bloque programable: puruva/papyre opyta mbojo'a ecuacion kuera matemática kuera avanzada kuera multivariable kuera, p.e. pyti´a (x ha z)

source: Cartesian
gug: Cartesiana

source: displays Cartesian coordinates
gug: techarã coordenada kuera cartesiana kuera

source: Python block
gug: bloque Python

source: runs code found in the tamyblock.py module found in the Journal
gug: ﻿ ojapo pe código pehẽngue gua tamyblock.py hina ojeojuhu pe kuatiahaipyre me/pe

source: gets a text string or an image from a URL
gug: ohupytu peteĩ itasã texto mba'e o peteĩ ta'anga guive peteĩ url

source: turtle shell
gug: apekue karumbe

source: put a custom 'shell' on the turtle
gug: pone peteĩ apekue personalizada lape karumbe

source: turtle
gug: karumbe

source: chooses which turtle to command
gug: ﻿ oiporavo pe karumbe ordenarpe

source: turtle x
gug: karumbe x

source: Returns x coordinate of turtle
gug: omyengovia pe coordenada x karumbe

source: turtle y
gug: karumbe y

source: Returns y coordinate of turtle
gug: omyengovia pe coordenada ha karumbe

source: active turtle
gug: karumbe activa

source: the name of the active turtle
gug: téra karumbe activa

source: turtle heading
gug: ﻿ rumbo karumbe

source: Returns heading of turtle
gug: ﻿ omyengovia pe rumbo karumbe

source: click to open
gug: ﻿ clic opyta mboty'o

source: top of a collapsed stack
gug: ﻿ tu'ã peteĩ mba'e aty colapsada

source: select palette
gug: seleccionar paleta

source: selects a palette
gug: ﻿ selecciona peteĩ paleta

source: load
gug: ﻿ hupi

source: forward
gug: ﻿ tenonde

source: loads a block
gug: ﻿ ohupi peteĩ bloque

source: setxy
gug: ﻿ moĩ xy

source: index
gug: índice

source: return the text of the positions
gug: ﻿ omyengovia pe texto mba'e posicion kuera

source: string
gug: itasã

source: start
gug: ﻿ empezar

source: end
gug: paha

source: Palette of presentation templates
gug: ﻿ paleta plantilla kuera mba'e presentacion kuera

source: portfolio
gug: voko

source: hide blocks
gug: ﻿ mo'ã bloque kuera

source: declutters canvas by hiding blocks
gug: limpia pe lienzo ocultando bloque kuera

source: show blocks
gug: hechauka bloque kuera

source: restores hidden blocks
gug: restaura bloque kuera amo'ã kuera

source: hides the Sugar toolbars
gug: ﻿ omo'ã barra kuera tembipuru kuera mba'e asuka

source: list
gug: lista

source: presentation bulleted list
gug: ﻿ presentación lista ndive viñeta kuera mba'e

source: presentation template: list of bullets
gug: ﻿ plantilla presentación: mba'e lista viñeta kuera

source: presentation template: select Journal object (no description)
gug: ﻿ plantilla presentación: mba'e seleccionar mba'e kuatiahaipyre gua ( ñemombe'upaite ỹre )

source: presentation template: select Journal object (with description)
gug: ﻿ plantilla presentación: mba'e seleccionar mba'e kuatiahaipyre gua ( ñemombe'upaite ndive )

source: presentation template: select four Journal objects
gug: ﻿ plantilla presentación: mba'e seleccionar irundy mba'e kuera kuatiahaipyre gua

source: presentation template: select two Journal objects
gug: ﻿ plantilla presentación: mba'e seleccionar irundy mba'e kuera kuatiahaipyre gua

source: left
gug: asúpe

source: xcor of left of screen
gug: ﻿ coorx asúpe tenda jepyso ohechaukáva ta'anga

source: bottom
gug: ﻿ guy

source: ycor of bottom of screen
gug: ﻿ coory limitegua inferior tenda jepyso ohechaukáva ta'anga

source: width
gug: pytaku

source: the canvas width
gug: ﻿ pe pyrusu lienzogua

source: right
gug: akatúa

source: xcor of right of screen
gug: ﻿ xcor yke gua yvi tenda jepyso ohechaukáva ta'anga

source: ycor of top of screen
gug: ﻿ ycor limitegua superior tenda jepyso ohechaukáva ta'anga

source: height
gug: ﻿ yvatekue

source: the canvas height
gug: ﻿ pe yvatekue lienzogua

source: title x
gug: ﻿ título x

source: title y
gug: título y

source: left x
gug: ﻿ asúpe x

source: top y
gug: ﻿ yvate ha

source: right x
gug: ﻿ akatúa x

source: bottom y
gug: ﻿ guy ha

source: Palette of user-defined operators
gug: ﻿ paleta operacion kuera mba'e definida kuera rehe pe oiporúva peteĩ mba'e

source: my blocks
gug: ﻿ che bloque kuera

source: brightness
gug: avera

source: light level detected by camera
gug: ﻿ yvatekue tendy mba'e detectado rehe pe koty

source: camera output
gug: ﻿ ta'anga koty

source: Average RGB color from camera is pushed to the stack
gug: ﻿ mbytegua sa'y mba'e rgb koty ojeomboyke lape aty

source: read value from RFID device
gug: ﻿ moñe'ẽ pe py'aguasu dispositivogua radiofrecuencia mba'e (rfid)

source: acceleration
gug: acelerómetro

source: push acceleration in x, y, z to heap
gug: ﻿ pone pe aceleración sapáva kuera x, ha z pe aty me/pe

source: light level detected by light sensor
gug: ﻿ yvatekue tendy mba'e detectado rehe pe sensor

source: sound
gug: pu

source: raw microphone input signal
gug: ﻿ señal jeikeha mba'e pu mbotuichaha

source: loudness
gug: ﻿ tuichakue

source: microphone input volume
gug: ﻿ tuichakue jeikeha mba'e pu mbotuichaha

source: microphone input pitch
gug: ﻿ frecuencia componente má kuera intensa pu gua presente pe jeikeha pu mbotuichaha mba'e me/pe

source: resistance
gug: pyrakuã

source: microphone input resistance
gug: ﻿ py'aguasu pyrakuã conectada lape jeikeha pu mbotuichaha mba'e (teko medición: 700 14000 ohm kuera)

source: voltage
gug: voltaje

source: microphone input voltage
gug: ﻿ py'aguasu voltajegua dc mbojoapyva/papyre lape jeikeha pu mbotuichaha mba'e (rango: 0.40 1.90 pundie guaranímeicha ipúva hérava ve )

source: uturn
gug: ﻿ jere pu'ae guaranímeicha ipúva me/pe

source: turns the turtle 180 degrees
gug: ﻿ ojere pe karumbe 180 grado kuera

source: Please install the Speak Activity and try again.
gug: ﻿ rehe pytyvõ instala pe actividad ñe'ẽ e intenta pyahu mba'e .

source: Spanish
gug: ﻿ españaygua

source: English
gug: Inglés

source: Sorry, I can't understand what you are asking about.
gug: ﻿ lo siento, nahániri aikatu kũmby reĩme preguntando. va

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
gug: ﻿ lo siento, nahániri oĩ mandu'a sãso opyta hupi che apytu'ũ . cierra otra kuera actividade kuera e intenta peteĩ jevy má kuera.

source: other
gug: ﻿ ambue kuera

source: push destination rgb value to heap
gug: apila el valor rgb a la pila

source: stop
gug: ﻿ pyta

source: play
gug: reproducir

source: save
gug: ñongatu

source: did not output to
gug: ﻿ nahániri pudo hai me/pe

source: doesn't like
gug: ﻿ nahániri chupe oha'ã

source: as input
gug: ﻿ akaru jeikeha

source: I don't know how to
gug: ﻿ nahániri aikuaa akaru japo

source: usage is
gug: ﻿ pe jeporu ha'e

source: No option action:
gug: ﻿ tembiapo ỹre alternativa:

source: File not found
gug: ﻿ fichero nahániri juhuva/papyre

source: Configuration directory not writable: %s
gug: ﻿Directorio configuración mba'e nahániri modificable: %s kuera

source: New
gug: pyahu

source: Show sample projects
gug: ﻿ hechauka proyecto kuera techapyrã mba'e

source: Save as
gug: ﻿ ñongatu akaru

source: Export as
gug: ﻿ mondo akaru

source: image
gug: ﻿ ta'anga

source: image (blocks)
gug: ﻿ ta'anga (bloque kuera)

source: icon
gug: icono

source: Quit
gug: ﻿ se

source: File
gug: ﻿ ñongatuha

source: Rescale coordinates
gug: ﻿ jupijupi coordenada kuera

source: Reset block size
gug: ﻿ restaurar pe jakatuha bloquegua

source: Show/hide blocks
gug: ﻿ mostar/ocultar bloque kuera

source: Tools
gug: ﻿ tembipuru kuera

source: Debug
gug: ﻿ mopotĩ

source: Turtle
gug: ﻿ karumbe

source: Plugins
gug: ﻿ extension kuera

source: About...
gug: ﻿ omboja . . .

source: You have unsaved work. Would you like to save before quitting?
gug: ﻿ oĩ mba'apo ñongatu ỹre . ¿chupe gustaría ñongatu mboyve se mba'e ?

source: Save project?
gug: ﻿ ¿ñongatu pe proyecto?

source: Plugin %s already installed
gug: Pe plugin %s kuera oĩ instalado. ma

source: myproject
gug: ﻿ miproyecto

source: Please restart %s in order to use the plugin.
gug: Reinicie %s kuera opyta katu puru pe plugin.

source: Please restart %s in order to unload the plugin.
gug: ﻿ reinicie %s kuera opyta katu pe´a pe plugin.

source: displays next palette
gug: ﻿ ﻿ techarã tai 'p' réra siguiente paleta

source: changes the orientation of the palette of blocks
gug: ﻿ omoambue pe orientación paleta bloque kuera mba'e

source: trash
gug: ﻿ yty

source: block is not exportable
gug: ﻿ pe bloque nahániri ha'e exportable

source: error while exporting block
gug: ﻿ jejavy jave ojeexportaba pe bloque

source: error in highlighted block
gug: ﻿ jejavy pe bloque resaltado me/pe

source: error
gug: jejavy

source: orientation
gug: orientación

source: next
gug: siguiente

source: shift
gug: mboyke

source: Please hit the Stop Button before making changes to your program
gug: ﻿ rehe pytyvõ , ombopu pe votõ monambi mboyve japo mba'e amoambue kuera tupe jejaporã

source: action
gug: tembiapo

source: my box
gug: ﻿ che ryru

source: Select blocks to share
gug: ﻿ selecciona bloque kuera opyta mboja'o

source: Really overwrite stack?
gug: ﻿ ¿oipota sobrescribir pe aty ?

source: Overwrite stack
gug: ﻿ sobrescribir aty

source: Really delete stack?
gug: ﻿ ¿oipota eliminar pe aty ?

source: empty trash
gug: ﻿ monandi papelera

source: Do you really want to empty the trash?
gug: ﻿ ¿oipota realmente monandi pe papelera?

source: Cannot write data to %s.
gug: ﻿ nahániri ojeoikatu hai amoarange kuera pe ñongatuha %s kuera. me/pe

source: Please choose a different save directory.
gug: ﻿ rehe pytyvõ oiporavo peteĩ carpeta oikoéva opyta ñongatu .

source: Please choose a different file name.
gug: ﻿ rehe pytyvõ elija peteĩ téra ñongatuha mba'e oikoéva .

source: xcor
gug: coorx

source: ycor
gug: coory

source: heading
gug: rumbo

source: shade
gug: tono

source: gray
gug: ﻿ hungy

source: color
gug: ﻿ sa'y

source: True
gug: ete

source: False
gug: japu

source: %s blocks image
gug: ﻿%s kuera ta'anga bloque kuera

source: invokes named action stack
gug: ﻿ invocar pe aty tembiapo mba'e mbohérava/papyre

source: named variable (numeric value)
gug: ﻿ hendave'ỹ mbohérava/papyre (py'aguasu numérico)

source: store in
gug: ﻿ ñongatu me/pe

source: value
gug: ﻿ py'aguasu

source: stores numeric value in named variable
gug: ﻿ oñongatu py'aguasu numérico pe hendave'ỹ herakuãva me/pe

source: Plugin could not be installed.
gug: ﻿ pe plugin nahániri oikatu teko instalado.

source: up
gug: ﻿ yvate

source: down
gug: ﻿ yvýpe

source: backspace
gug: ﻿ retroceso

source: tab
gug: tabulador

source: space
gug: ﻿ arapy

source: delete
gug: ﻿ pe´a

source: Title
gug: título

source: banana
gug: pakova

source: Load...
gug: ﻿ hupi . . .

source: Save...
gug: ﻿ ñongatu . . .

source: Palette of turtle commands
gug: ﻿ paleta comando kuera mba'e karumbe

source: moves turtle forward
gug: ﻿ omomyi pe karumbe kotyo tenonde

source: back
gug: ﻿ tapykuépe

source: moves turtle backward
gug: ﻿ omomyi pe karumbe kotyo tapykuépe

source: clean
gug: mopotĩ

source: clears the screen and reset the turtle
gug: ﻿ limpia pe tenda jepyso ohechaukáva ta'anga ha restaura pe karumbe

source: turns turtle counterclockwise (angle in degrees)
gug: ﻿ ojere pe karumbe andupáva anti-horario (takamby grado kuera) me/pe

source: turns turtle clockwise (angle in degrees)
gug: ﻿ ojere pe karumbe andupáva horario (takamby grado kuera) me/pe

source: arc
gug: yvyrapã

source: angle
gug: takamby

source: radius
gug: ﻿ ñe´ẽ mombyry inimbo´ỹre

source: moves turtle along an arc
gug: ﻿ omomyi pe karumbe lope puku peteĩ mba'e yvyrapã

source: set xy
gug: ﻿ moĩ xy

source: y
gug: ﻿ ha

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
gug: ﻿ omomyi pe karumbe lape posición xcor, ycor; (0, 0) oĩ pe amombyte tenda jepyso ohechaukáva ta'anga . me/pe

source: set heading
gug: ﻿ moĩ rumbo

source: sets the heading of the turtle (0 is towards the top of the screen.)
gug: ﻿ omoĩ pe orientación karumbe (0 ha'e kotyo pe osẽ superior tenda jepyso ohechaukáva ta'anga . )

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
gug: ﻿ contiene pe coordenada x ko'ãgagua karumbe (oje oikatu puru jevy peteĩ mba'e bloque papaha ) me/pe

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
gug: ﻿ contiene pe coordenada ha ko'ãgagua karumbe (oje oikatu puru jevy peteĩ mba'e bloque papaha ) me/pe

source: holds current heading value of the turtle (can be used in place of a number block)
gug: ﻿ contiene pe orientación ko'ãgagua karumbe (oje oikatu puru jevy peteĩ mba'e bloque papaha ) me/pe

source: Palette of pen commands
gug: ﻿ paleta órden kuera mba'e pluma

source: pen
gug: pluma

source: fill screen
gug: ﻿ myenyhe tenda jepyso ohechaukáva ta'anga
