Repository: Kiy4h/TortugadeMexico
Catalog: po/gug.po
Languages: gug

source: fills the background with (color, shade)
gug: ﻿ rellena pe tugua ndive (sa'y , ã )

source: set color
gug: ﻿ moĩ sa'y

source: sets color of the line drawn by the turtle
gug: ﻿ omoĩ pe sa'y línea hina pe karumbe oha'ãngahai

source: set shade
gug: ﻿ moĩ tono

source: sets shade of the line drawn by the turtle
gug: ﻿ omoĩ pe tonalidad linea hina pe karumbe oha'ãngahai

source: set gray
gug: ﻿ establecer hungy

source: sets gray level of the line drawn by the turtle
gug: ﻿ establece pe yvatekue hungy mba'e línea dibujada rehe pe karumbe

source: holds current pen color (can be used in place of a number block)
gug: ﻿ contiene pe sa'y ko'ãgagua pluma (oje oikatu puru jevy peteĩ mba'e bloque papaha ) me/pe

source: holds current pen shade
gug: ﻿ contiene pe tonalidad ko'ãgagua pluma

source: holds current gray level (can be used in place of a number block)
gug: ﻿ contiene pe yvatekue ko'ãgagua hungy mba'e (oikatu teko puruva/papyre jevy peteĩ bloque numérico) me/pe

source: pen up
gug: ﻿ jupi pluma

source: Turtle will not draw when moved.
gug: ﻿ pe karumbe nahániri oha'ãngahaita ave ojemueva.

source: pen down
gug: ﻿ guejy pluma

source: Turtle will draw when moved.
gug: ﻿ pe karumbe oha'ãngahaita ave ojemueva.

source: pen down?
gug: ﻿ ¿pluma oguejy ?

source: returns True if pen is down
gug: ﻿ omyengovia ete pe pluma oĩ oguejy rõ

source: set pen size
gug: ﻿ moĩ jakatuha

source: sets size of the line drawn by the turtle
gug: ﻿ omoĩ pe pyrusu línea hina pe karumbe oha'ãngahai

source: start fill
gug: ﻿ ñepyrũ rellenarpe

source: starts filled polygon (used with end fill block)
gug: ﻿ ñepyrũ rellenarpe pe poligono (puruva/papyre japopa ndive pe relleno bloquegua )

source: end fill
gug: ﻿ japopa relleno

source: completes filled polygon (used with start fill block)
gug: completa el polígono relleno (utilizado con comenzar relleno del bloque)

source: pen size
gug: ﻿ jakatuha

source: holds current pen size (can be used in place of a number block)
gug: ﻿ contiene pe jakatuha ko'ãgagua pluma (oje oikatu puru jevy peteĩ mba'e bloque papaha ) me/pe

source: Palette of pen colors
gug: ﻿ paleta sa'y kuera mba'e pluma

source: colors
gug: ﻿ sa'y kuera

source: red
gug: ﻿ pytã

source: orange
gug: ﻿ narã

source: yellow
gug: ﻿ sa'yju

source: green
gug: ﻿ hovy

source: cyan
gug: ﻿ cian

source: blue
gug: ﻿ hovy

source: purple
gug: ﻿ ikova/papyre

source: white
gug: ﻿ morotĩ

source: black
gug: ﻿ kamba

source: RGB to color
gug: RGB a color

source: converter
gug: ﻿ moambue

source: Palette of numeric operators
gug: ﻿ paleta operador kuera mba'e numérico kuera

source: numbers
gug: ﻿ papaha kuera

source: plus
gug: sumar

source: adds two alphanumeric inputs
gug: ﻿ suma mokõi jeikeha kuera alfanumérica kuera

source: minus
gug: ﻿ mbovyve

source: subtracts bottom numeric input from top numeric input
gug: ﻿ sustrae pe jeikeha numérica yvýpe mba'e jeikeha numérica yvate

source: multiply
gug: ﻿ ñembohetave

source: multiplies two numeric inputs
gug: ﻿ oñembohetave mokõi jeikeha kuera numérica kuera

source: divide
gug: ﻿ pa'ũndy

source: divides top numeric input (numerator) by bottom numeric input (denominator)
gug: ﻿ opa'ũndy pe jeikeha numérica yvate mba'e (numerador) rehe pe jeikeha numérica aguejy (denominador)

source: identity
gug: rekotee

source: identity operator used for extending blocks
gug: ﻿ operador rekotee mba'e puruva/papyre opyta myasãi bloque kuera

source: modular (remainder) operator
gug: ﻿ operador módular (resto)

source: square root
gug: raiz cuadrada

source: calculates square root
gug: ﻿ calcula pe tapo cuadrada

source: random
gug: aleatorio

source: returns random number between minimum (top) and maximum (bottom) values
gug: ﻿ omyengovia peteĩ papaha aleatorio apytépe py'aguasu kuera michĩvéva (yvate ) ha tuichaiteve (yvýpe )

source: number
gug: papaha

source: used as numeric input in mathematic operators
gug: ﻿ puruva/papyre akaru jeikeha numérica operador kuera matemático kuera me/pe

source: greater than
gug: ﻿ guasuve hina

source: logical greater-than operator
gug: ﻿ operador lógico guasuve hina

source: less than
gug: ﻿ michĩve hina

source: logical less-than operator
gug: ﻿ operador lógico michĩve hina

source: equal
gug: ﻿ ha'ete

source: logical equal-to operator
gug: ﻿ operador lógico joja mba'e

source: not
gug: ﻿ nahániri

source: logical NOT operator
gug: ﻿ operador nahániri lógico

source: and
gug: ﻿ ha

source: logical AND operator
gug: ﻿ operador ha lógico

source: or
gug: o

source: logical OR operator
gug: operador o lógico

source: flow
gug: ﻿ syry

source: wait
gug: ﻿ ha'arõ

source: pauses program execution a specified number of seconds
gug: ﻿ omonambi pe jejapo jejaporã gua rehe papaha japoukava/papyre mokõiha-2-/aravo'ive kuera mba'e

source: forever
gug: ﻿ rehe tapiã

source: loops forever
gug: ﻿ ha'ejevy opyta tapiã

source: repeat
gug: ha'ejevy

source: loops specified number of times
gug: ﻿ repite pe papaha especificado vece kuera mba'e

source: if
gug: ﻿ rõ

source: then
gug: ﻿ upéicharõ

source: if then
gug: ﻿ upéicharõ rõ

source: if-then operator that uses boolean operators from Numbers palette
gug: ﻿ operador si-entonce kuera hina oipuru operador kuera lógico kuera paleta papaha kuera mba'e

source: else
gug: sino

source: if then else
gug: ﻿ upéicharõ sino rõ

source: if-then-else operator that uses boolean operators from Numbers palette
gug: ﻿ operador si-entonces-sino hina oipuru operador kuera lógico kuera paleta papaha kuera mba'e

source: horizontal space
gug: ﻿ arapy horizontal

source: jogs stack right
gug: ﻿ omboyke pe aty lape akatúa

source: vertical space
gug: ﻿ arapy oñembo'ýva

source: jogs stack down
gug: ﻿ mboyke pe aty yvýpe

source: stop action
gug: ﻿ pyta tembiapo

source: stops current action
gug: ﻿ omonambi pe tembiapo ko'ãgagua

source: Palette of variable blocks
gug: ﻿ paleta bloque kuera mba'e hendave'ỹ kuera

source: blocks
gug: ﻿ bloque kuera

source: connects action to toolbar run buttons
gug: ﻿ ombojoapy pe tembiapo los-pe botones jejapo mba'e barra tembipuru kuera

source: top of nameable action stack
gug: ﻿ tu'ã aty tembiapo mba'e nombrable

source: store in box 1
gug: ﻿ ñongatu ryru 1 me/pe

source: stores numeric value in Variable 1
gug: ﻿ oñongatu py'aguasu numérico pe hendave'ỹ 1 me/pe

source: store in box 2
gug: ﻿ ñongatu ryru 2 me/pe

source: stores numeric value in Variable 2
gug: ﻿ oñongatu py'aguasu numérico pe hendave'ỹ 2 me/pe

source: box 1
gug: ﻿ ryru 1

source: Variable 1 (numeric value)
gug: ﻿ hendave'ỹ 1 (py'aguasu numérico)

source: box 2
gug: ﻿ ryru 2

source: Variable 2 (numeric value)
gug: ﻿ hendave'ỹ 2 (py'aguasu numérico)

source: box
gug: ryru

source: action 1
gug: ﻿ tembiapo 1

source: top of Action 1 stack
gug: primero de la pila de Acción 1

source: action 2
gug: ﻿ tembiapo 2

source: top of Action 2 stack
gug: ﻿ peteĩha aty tembiapo mba'e 2

source: invokes Action 1 stack
gug: ﻿ invoca pe aty tembiapo 1

source: invokes Action 2 stack
gug: ﻿ invoca pe aty tembiapo 2

source: invokes named action stack and returns value
gug: ﻿ invoca peteĩ tembiapo rehe pe téra ha omyengovia peteĩ py'aguasu

source: return
gug: jere

source: returns a value
gug: ﻿ omyengovia peteĩ py'aguasu

source: permanently deletes items in trash
gug: ﻿ ombogue manterei apỹi kuera papelera

source: restore all
gug: ﻿ restaurar opakatu

source: restore all blocks from trash
gug: ﻿ restaura opakatu kuera bloque kuera papelera

source: clear all
gug: ﻿ mbogue opakatu kuera

source: move all blocks to trash
gug: ﻿ omomyi opakatu kuera bloque kuera lape yty
