Repository: Kiy4h/TortugadeMexico
Catalog: po/quz.po
Languages: quz

source: TurtleBlocks
quz: CharapaBlocks

source: Please wait
quz: Suyarillayyá

source: Starting connection...
quz: T'inkinaqa qallarichkanmi...

source: Export as python
quz: Python nisqahina aparquchiy

source: Error: You must use a Start Block when exporting to Python.
quz: Pastasqam: Python nisqaman apachinki hina Qallariy nisqa Bloqueta apaykachanaykiqa.

source: snapshot
quz: utqayllachasqa

source: Turn off hover help
quz: Tuytuq yanapayta wañuchiy

source: Turn on hover help
quz: Tuytuq yanapayta hap'ichiy

source: Show palette
quz: Llimp'iymaruta rikuchiy

source: Hide palette
quz: Llimp'iymaruta pakay

source: Show blocks
quz: Bloquekunata rikuchiy

source: Hide blocks
quz: Bloquekunata pakay

source: Rescale coordinates down
quz: T'urpisiq'ikunata urayman suchuykuchiy

source: Rescale coordinates up
quz: T'urpisiq'ikunata wichayman suchurquchiy

source: Edit
quz: Allinchay

source: View
quz: Qhaway

source: Copy
quz: Kikinchay

source: Paste
quz: K'askachiy

source: Restore blocks from trash
quz: Q'upachuranap bloquenkunata kutiykachiy

source: Save stack
quz: Pila nisqata waqaychay

source: Delete stack
quz: Pila nisqata pichay

source: Fullscreen
quz: Hunt'asqa pantalla

source: Cartesian coordinates
quz: Coordenadas cartesianas nisqa

source: Polar coordinates
quz: Coordenadas polares nisqa

source: Metric coordinates
quz: Coordenadas centímetros nisqa

source: Grow blocks
quz: Bloquekunata hatunyachiy

source: Shrink blocks
quz: Bloquekunata huch'uyyachiy

source: Load example
quz: Qhawarichikunata hunt'achiy

source: Save/Load
quz: Waqaychay/Hunt'achiy

source: Project
quz: Wakichina

source: Clean
quz: Pichay

source: Run
quz: Rurariy

source: Step
quz: Huk tatkiyta ruray

source: Stop turtle
quz: Charapata sayarichiy

source: Help
quz: Yanapay

source: Stop
quz: Sayachiy

source: Share selected blocks
quz: Akllasqa bloquekunata qunakuy

source: Save as image
quz: Wankihinata waqaychay

source: Save as icon
quz: Rikch’aytahina waqaychay

source: Save as ODP
quz: ODP nisqatahina waqaychay

source: Save as Logo
quz: Logo nisqatahina waqaychay

source: Save as Python
quz: Python nisqatahina waqaychay

source: Save snapshot
quz: Utqaylla rurasqata waqaychay

source: Add project
quz: Wakichinata yapay

source: Load plugin
quz: Plugin nisqata churay

source: Load Python block
quz: Pythonta wicharichiy

source: Palettes
quz: Llimp'iymaru

source: Sharing blocks disabled
quz: Wañuchisqa bloque nisqakunata qunakuy

source: Save
quz: Waqaychay

source: Load
quz: Wichachiy

source: Open
quz: Kichay

source: Plugin %s already installed.
quz: Plugin %s nisqaqa churasqañam kachkan.

source: Do you want to reinstall %s?
quz: Munankichu %s nisqata wakmanta churayta?

source: My Turtle Art session
quz: CharapArte nisqaymanta yachakuyniy

source: Enable collaboration
quz: Yanapanakupaq kamariy

source: Activities
quz: Ruranakuna

source: Buddies
quz: Masikuna

source: Share
quz: Qunakuy

source: Configuration
quz: Allichana

source: Neighborhood
quz: llaqtamasichakuna

source: Nickname
quz: Yanqasuti

source: Account ID
quz: Cuentay

source: Server
quz: Haywarikuq

source: Port
quz: Chayana

source: Password
quz: Pakaqillqa

source: Register
quz: Khipuykuy

source: Colors
quz: Llimp'ikuna

source: Upload
quz: Wichachiy

source: Facebook wall post
quz: Facebookpa pirqan

source: Upload to Web
quz: Webman apachiy

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
quz: Wakichinata urayachinapaqqa http://turtleartsite.sugarlabs.org nisqapim huk cuenta nisqayuq kanan.

source: Username:
quz: Apaykachaqmasip sutin:

source: Password:
quz: Pakaqillqa:

source: Title:
quz: Sutinchaynin:

source: Description:
quz: Sut'inchay:

source: Submit to Web
quz: Webman apachiy

source: Cancel
quz: Chinkachiy

source: Login failed
quz: Chiqanchayqa pantarqunmi

source: Failed to upload!
quz: ¡Urayachichkaspa pantarqun!

source: The path to the TurtleArt installation must be listed in the environment variable PYTHONPATH.
quz: TurtleArt churanaman riq ñanqa variable de entorno PYTHONPATH nisqa chawpipi kananmi.

source: Palette of flow operators
quz: Purina apaykachaqpa llimp'iymaru

source: while
quz: chaykamaqa

source: do-while-True operator that uses boolean operators from Numbers palette
quz: yupana llimp'iymarup booleano nisqa rurariqkuna apaykachaq operador do-while-True nisqa

source: until
quz: kaykama

source: do-until-True operator that uses boolean operators from Numbers palette
quz: yupana llimp'iymarup booleano nisqa rurariqkuna apaykachaq operador do-until-True nisqa

source: top
quz: umapatan

source: top of a collapsible stack
quz: q'impikuq-hina tawqa umapatanpi

source: Palette of media objects
quz: Chawpi bloquekunap llimp'iymarun

source: media
quz: ima chawpikunapi

source: journal
quz: p'anqa

source: Sugar Journal media object
quz: Sugar Panq'ap medios nisqanpa mañasqan

source: audio
quz: uyarina

source: Sugar Journal audio object
quz: Sugar Panq'ap uyarinanpa mañasqan

source: video
quz: qhawarina

source: Sugar Journal video object
quz: Sugar P'anqap qhawarinanpa mañasqan

source: description
quz: sut'inchana

source: Sugar Journal description field
quz: Sugar P'anqap sut'inchaynin k'itin

source: text
quz: qillqasqa

source: string value
quz: waskharchakuqpa chanin

source: show
quz: rikuchiy

source: draws text or show media from the Journal
quz: P'anqamanta chawpichasqata rikuchiy utaq qillqasqata siq'ipay

source: show aligned
quz: sinrichasqakunata rikuchiy

source: set scale
quz: patapatata churarquy

source: sets the scale of media
quz: medios nisqakunap patapatanta churarquy

source: set font
quz: imayna qillqataq kanqa

source: sets the font used by the show block
quz: qhawachiy nisqa bloquep apaykachasqa imayna qillqata churariy

source: save picture
quz: wankita waqaychay

source: picture name
quz: wankip sutin

source: saves a picture to the Sugar Journal
quz: Sugar P'anqapim huk wankita waqaychay

source: save SVG
quz: SVG khiputa waqaychay

source: saves turtle graphics as an SVG file in the Sugar Journal
quz: charapap rikchayninkunataqa Sugarpa p'anqanpim waqaychay

source: scale
quz: patapata

source: holds current scale value
quz: patapatap hunan chaninmi kachkallan

source: media wait
quz: mediokunata suyariy

source: wait for current video or audio to complete
quz: uyarinata utaq qhawarinata tukunankama suyariy

source: media stop
quz: mediokunata sayachiy

source: stop video or audio
quz: qhawarinata utaq uyarinata sayachin

source: media pause
quz: mediokunata suyachiy

source: pause video or audio
quz: qhawarinata utaq uyarinata suyachiy

source: media resume
quz: mediokunata rikuchiy

source: resume playing video or audio
quz: qhawarinata utaq uyarinata wakmanta puriykachillay

source: speak
quz: rimay

source: hello
quz: imaynalla

source: speaks text
quz: qillqasqa ninmi

source: sinewave
quz: sinusoide nisqa

source: pitch
quz: kutikuti

source: amplitude
quz: amplitud nisqa

source: duration
quz: hayk'appaqtaq

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
quz: Huk sinusoide nisqata frecuencianmanta, amplitudmantawan, unayayninmantawan puririchiy (kayqa segundos pachapi)

source: Palette of sensor blocks
quz: Hap'irquchiq bloquekunap llimp'iymarun

source: sensor
quz: hap’irquchiq

source: button down
quz: ñit'inaqa ñitisqam kachkan

source: returns 1 if mouse button is pressed
quz: huk'uchap ñit'inan q'apiyasqa kaptinqa 1 yupaytam kutichin

source: returns True if mouse button is pressed
quz: huk'uchap ñit'inan q'apiyasqa kaptinqa 1 Chiqan nisqatam kutichin

source: mouse x
quz: x t'upsiriq

source: returns mouse x coordinate
quz: t'upsiriqpa x t'urpisiq'inta kutichin

source: mouse y
quz: t'upsiriq y

source: returns mouse y coordinate
quz: t'upsiriqpa y t'urpisiq'inta kutichin

source: query keyboard
quz: Qillqayñit'inamanta tapuriy

source: query for keyboard input (results stored in keyboard block)
quz: qillqayñit'inap yaykuyninta tapurinapaq (yachasqakunaqa qillqayñit'inap bloque nisqanpi waqaychasqam)

source: keyboard
quz: qillqayñit'ina

source: holds results of query-keyboard block as ASCII
quz: kayhina ASCII nisqahina qillqayñit'inamanta tapurikuypa bloquenpa yachasqanniyuqmi

source: read pixel
quz: pixel nisqata ñawinchay

source: RGB color under the turtle is pushed to the stack
quz: Charapapi RGB llimp'i kasqantam tawqamanqa apachikun

source: turtle sees
quz: charapaqa qhawachkan

source: returns the color that the turtle "sees"
quz: charapap llimp'i "qhawasqatam" rikuchin

source: time
quz: pacha

source: elapsed time (in seconds) since program started
quz: programa qallarisqanmantaraq unayasqan (segundos nisqapi)

source: Palette of extra options
quz: Wak akllanakunapaq maru

source: extras
quz: wakkunawan

source: push
quz: ñit'iykuy

source: pushes value onto FILO (first-in last-out heap)
quz: kay FILO nisqa tawqamanmi chaninta churapay (yaykuypiqa hukñiqim, lluqsiypitaq qhipañiqim)

source: show heap
quz: tawqata rikuchiy

source: shows values in FILO (first-in last-out heap)
quz: kay FILO nisqa tawqap chanintam rikuchin (yaykuypiqa hukñiqim, lluqsiypitaq qhipañiqim)

source: empty heap
quz: tawqata qasichiy

source: emptys FILO (first-in-last-out heap)
quz: kay FILO nisqa tawqata qasichiy (yaykuypiqa hukñiqim, lluqsiypitaq qhipañiqim)

source: pop
quz: hurquy

source: pops value off FILO (first-in last-out heap)
quz: kay FILO nisqa tawqap chaninta hurquy (yaykuypiqa hukñiqim, lluqsiypitaq qhipañiqim)

source: empty heap?
quz: ¿ch'usaq tawqa?

source: returns True if heap is empty
quz: tawqa ch'usaq kaptinqa Chiqaqmi nispam rikunchin

source: save heap to file
quz: khipupi tawqata waqaychay

source: filename
quz: khipup sutin

source: saves FILO (first-in last-out heap) to a file
quz: waqaychay kay FILO nisqa tawqata (yaykuypiqa hukñiqim, lluqsiypitaq qhipañiqim) khipupi

source: load heap from file
quz: khipup tawqanta wichachiy

source: loads FILO (first-in last-out heap) from a file
quz: wichachiy kay FILO nisqa tawqata (yaykuypiqa hukñiqim, lluqsiypitaq qhipañiqim) huk khipumanta

source: comment
quz: rimariy

source: places a comment in your code
quz: chimpuykipiqa huk rimariyta churay

source: print
quz: takarquy

source: prints value in status block at bottom of the screen
quz: pantallap urayninpi kay kaqpa bloquenpi chaninta takarqun

source: Python chr operator
quz: Python nispap operador chr nisqan

source: Python int operator
quz: Python nispap operador int nisqan

source: polar
quz: polar nisqa

source: displays polar coordinates
quz: coordenadas polares nisqatam rikuchin

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
quz: huk wakichiyhina bloque: ch'ulla variableyuq ecuaciones matematicas avanzadas nisqa yapanapaq apaykachasqam, qhawarinapaq hinaqa, seno(x)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
quz: huk wakichiyhina bloque: achka variableyuq ecuaciones matematicas avanzadas nisqa yapanapaq apaykachasqam, i.e., sqrt(x*x+y*y)

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
quz: huk wakichiyhina bloque: achka variableyuq ecuaciones matematicas avanzadas nisqa yapanapaq apaykachasqam, i.e., seno(x+y+z)

source: Cartesian
quz: Cartesiana

source: displays Cartesian coordinates
quz: coordenadas cartesianas nisqatam rikuchin

source: Python block
quz: Python nisqa bloque

source: runs code found in the tamyblock.py module found in the Journal
quz: kay P'anqapi kaq módulo tamyblock.py nisqap chimpuntam puriykachin

source: gets a text string or an image from a URL
quz: huk URL nisqamanta huk qillqasqakunata utaq huk wankita chaskiy

source: turtle shell
quz: charapap wasaqaran

source: put a custom 'shell' on the turtle
quz: charapamanqa takyasqa wasaqarata churay

source: turtle
quz: charapa

source: chooses which turtle to command
quz: kamachinapaq charapata akllakuy

source: turtle x
quz: charapa x

source: Returns x coordinate of turtle
quz: Charapan x t'urpisiq'inta kutichin

source: turtle y
quz: charapa y

source: Returns y coordinate of turtle
quz: Charapan y t'urpisiq'inta kutichin

source: active turtle
quz: kawsachkaq charapa

source: the name of the active turtle
quz: kawsachkaq charapap sutin

source: turtle heading
quz: charapa purina

source: Returns heading of turtle
quz: charapap purinanta kutichin

source: click to open
quz: kicharinapaqqa clickta ruray

source: top of a collapsed stack
quz: q'impikuq tawqap umapatanpi

source: select palette
quz: llimp'iymaruta akllariy

source: selects a palette
quz: huk llimp'iymaruta akllariy

source: load
quz: wichachiy

source: forward
quz: ñawpaqman

source: loads a block
quz: huk bloque nisqata wichachiy

source: setxy
quz: xy nisqata churay

source: index
quz: Imayuqtaq

source: return the text of the positions
quz: chaypi kaq qillqasqakunata kutichin

source: string
quz: wallqa

source: start
quz: qallariy

source: end
quz: tukuy

source: Palette of presentation templates
quz: Qhawachinakunap plantillanpa marun

source: portfolio
quz: wayaqa

source: hide blocks
quz: bloques nisqakunata pakay

source: declutters canvas by hiding blocks
quz: bloque nisqakunata pakaspa lienzota pichay

source: show blocks
quz: bloques nisqakunata rikuchiy

source: restores hidden blocks
quz: pakasqa bloquekunata llanllariy

source: hides the Sugar toolbars
quz: Sugarpa llamk'anankunata pakay

source: list
quz: sinri

source: presentation bulleted list
quz: ratachiqkunap sinrinniyuq qhawachina

source: presentation template: list of bullets
quz: qhawachinapaq yupi: ratachiqkunayuq sinri

source: presentation template: select Journal object (no description)
quz: qhawachinapaq yupi: P'anqamanta huk imatapas akllariy (mana willayniyuq kaqta)

source: presentation template: select Journal object (with description)
quz: qhawachinapaq yupi: P'anqamanta imatapas akllariy (willayniyuq kaqta)

source: presentation template: select four Journal objects
quz: qhawachinapaq yupi: P'anqamanta tawa imaymanakunata akllariy

source: presentation template: select two Journal objects
quz: qhawachinapaq yupi: P'anqamanta iskay imaymanakunata akllariy

source: left
quz: lluq'i

source: xcor of left of screen
quz: pantallap lluq'inpi kaq coorx

source: bottom
quz: uraynin

source: ycor of bottom of screen
quz: pantallap urayninpi kaq coory

source: width
quz: kinraynin

source: the canvas width
quz: lienzop kinraynin

source: right
quz: paña

source: xcor of right of screen
quz: pantallap pañanpi kaq coorx

source: ycor of top of screen
quz: pantallap wichayninpi kaq coory

source: height
quz: sayaynin

source: the canvas height
quz: lienzop sayaynin

source: title x
quz: x sutinchaynin

source: title y
quz: y sutinchaynin

source: left x
quz: lluq'i x

source: top y
quz: wichay y

source: right x
quz: paña x

source: bottom y
quz: uraypi y

source: Palette of user-defined operators
quz: Apaykachaqmasip churasqa llamk'anapaq maru

source: my blocks
quz: bloquey

source: brightness
quz: k'anchaqnin

source: light level detected by camera
quz: cámaraq rikusqa llipipiypa tupun

source: camera output
quz: cámarap wankin

source: Average RGB color from camera is pushed to the stack
quz: Cámarap RGB nisqap llimp'inpa kuskanchasqanqa pilaman richkan

source: RFID
quz: RFID nisqa radiofrecuenciamanta riqsina

source: read value from RFID device
quz: radiofrecuencia RFID nisqap chaninta ñawinchay

source: acceleration
quz: utqaychaqtupu

source: push acceleration in x, y, z to heap
quz: Pilapi kay kaq x, y z sayachiykunaman utqaychayta churaqmi

source: light level detected by light sensor
quz: hapirquchiqpa rikusqa llipipiypa tupun

source: sound
quz: uyarikuq

source: raw microphone input signal
quz: micrófonop yaykunanpa tuyruynin

source: loudness
quz: wulumin

source: microphone input volume
quz: micrófonop yaykunanpa wuluminnin

source: microphone input pitch
quz: microfonop yaykuyninpi kaq uyarikuqpa sinchi kallpayuq imanpa kutikutin

source: resistance
quz: kallpayuqchay

source: microphone input resistance
quz: microfonop yaykuyninman t'inkisqa kallpayuqchaypa chanin (tupun: 700 - 14000 ohms)

source: voltage
quz: voltaje nisqa

source: microphone input voltage
quz: microfonop yaykuyninman t'inkisqa DC voltaje nisqap voltajen (tupun: 0.40 - 1.90 V)

source: uturn
quz: kayhina U hinaman muyurin

source: turns the turtle 180 degrees
quz: charapachata 180 grados nisqata muyurichiy

source: Please install the Speak Activity and try again.
quz: Mira, churariy Rimay ruwanata, chaymantaqa wakmanta ruwariy.

source: Spanish
quz: Castellano simi

source: English
quz: Inglés simi

source: Sorry, I can't understand what you are asking about.
quz: Pampachaway, manam yachachkanichu tapuwasqaykitaqa.

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
quz: Pampachaway, umanchayqa hunt'añam kachkan. Huk ruranakunata wichq'ay ichaqa wakmanta qallariwaq.

source: other
quz: wakkuna

source: push destination rgb value to heap
quz: tawqamanmi rgb nisqa chaninqa churan

source: stop
quz: sayachiy

source: play
quz: purichiy

source: save
quz: waqaychay

source: did not output to
quz: mana atinichu kaypi qillqaytaqa

source: doesn't like
quz: manam chuymanpaqhinachu

source: as input
quz: yaykusqahinam

source: I don't know how to
quz: Manam imayna ruraytapas yachanichu

source: usage is
quz: hap'iyqa kaymi

source: No option action:
quz: Mana ima rurayniyuq:

source: File not found
quz: Mana tarisqa khipu

source: Configuration directory not writable: %s
quz: Mana t'ikrakuq hina allichaypa chimpuwayaqa: %s

source: New
quz: Musuq

source: Show sample projects
quz: Huk sut'ichaq wakichinakunata qhawarichiy

source: Save as
quz: Kay hinata waqaychay

source: Export as
quz: Kayhinata aparquchiy

source: image
quz: wanki

source: icon
quz: rikch’ay

source: Quit
quz: Lluqsiy

source: File
quz: Khipu

source: Rescale coordinates
quz: T'urpisiq'ikunata suchuykuchiy

source: Reset block size
quz: Bloquep sayayninta llanllarichiy

source: Show/hide blocks
quz: Bloques nisqakunata qhawachiy/pakay

source: Tools
quz: Llamk'anakuna

source: Debug
quz: Wikch'urquy

source: Turtle
quz: Charapa

source: Plugins
quz: Mast'ariykuna

source: About...
quz: Kaymanta...

source: You have unsaved work. Would you like to save before quitting?
quz: Mana waqaychasqa llamk'asqam kachkan. ¿Amaraq lluqsichkaspa, waqaychayta munankichu?

source: Save project?
quz: ¿Wakichinata waqaychankichu?

source: Plugin %s already installed
quz: Plugin %s nisqaqa churasqañam kachkan.

source: myproject
quz: Wakichiyniy

source: Please restart %s in order to use the plugin.
quz: Plugin nisqa apaykachanapaq %s nisqata wakmanta qallarichiy.

source: Please restart %s in order to unload the plugin.
quz: Plugin nisqa chinkachinapaqqa %s nisqata wakmanta qallarichiy.

source: displays next palette
quz: hamuq marutam rikuchin

source: changes the orientation of the palette of blocks
quz: bloque nisqakunap marunpa mayman qhawariyninta t'ikrachiy

source: trash
quz: q'upa

source: block is not exportable
quz: bloqueqa manam wak k'itiman apachiyhinachu

source: error while exporting block
quz: bloqueta wak k'itiman apachichkaspam pantasqa

source: error in highlighted block
quz: hatunchasqa bloquepi pantasqam kan

source: error
quz: pantasqam

source: orientation
quz: mayman riynin

source: next
quz: hamuq

source: shift
quz: purichiy

source: Please hit the Stop Button before making changes to your program
quz: Sayachiy nisqa Ñit'inata ñit'iykuy manaraq programaykita t'ikraspa

source: action
quz: ruraykuy

source: my box
quz: kahunniy

source: Select blocks to share
quz: Qukunapaq bloques nisqakunata akllay

source: Really overwrite stack?
quz: ¿Munanchichu pila nisqa tawqap patanman qillqayta munawaqchu?

source: Overwrite stack
quz: Pila nisqa tawqap patanman qillqay

source: Really delete stack?
quz: ¿Munakichu Pila nisqa tawqata pichayta?

source: empty trash
quz: q'upanata qasichiy

source: Do you really want to empty the trash?
quz: ¿Q'upanata qasichiyta munankipunichu?

source: Cannot write data to %s.
quz: Manam imapas qillqayta atikunmanchu %s khipupiqa

source: Please choose a different save directory.
quz: Waqyanapaq wak khiputa akllariy.

source: Please choose a different file name.
quz: Wak khipup sutinta allkariy

source: xcor
quz: coorx

source: ycor
quz: coory

source: heading
quz: mayman purina

source: shade
quz: llimp'ip k'anchaynin

source: gray
quz: uqi

source: color
quz: llimp'i

source: True
quz: Chiqan

source: False
quz: Mana chiqan

source: invokes named action stack
quz: sutichasqa tawqata waqyay

source: named variable (numeric value)
quz: sutichasqa variable (yupanap chanin)

source: store in
quz: imapi waqaychanki

source: value
quz: chani

source: stores numeric value in named variable
quz: yupanap chanintaqa variable sutichasqapim waqaychan

source: Plugin could not be installed.
quz: Plugin nisqaqa churachiykuytaqa manam atichikunchu.

source: up
quz: wichay

source: down
quz: uray

source: backspace
quz: qhipaman kutiriy

source: tab
quz: kuyuchiq

source: space
quz: k'iti

source: delete
quz: chinkachiy

source: Title
quz: Sutinchaynin

source: banana
quz: latanu

source: Load...
quz: Wichachichkallay...

source: Save...
quz: Waqaychay...

source: Palette of turtle commands
quz: Charapata kamachinapaq maru

source: moves turtle forward
quz: ñawpaqman charapata purichiy

source: back
quz: kutichiy

source: moves turtle backward
quz: qhipaman charapata kutichiy

source: clean
quz: pichay

source: clears the screen and reset the turtle
quz: pantallata pichay charapatataq musuqmanta llanllariy

source: turns turtle counterclockwise (angle in degrees)
quz: charapataqa lluq'imanhina muyurichiy (ángulo en grados nisqapi)

source: turns turtle clockwise (angle in degrees)
quz: charapataqa pañamanhina muyurichiy (ángulo en grados nisqapi)

source: arc
quz: k'uychichasqa

source: angle
quz: k'uchu

source: radius
quz: radio

source: moves turtle along an arc
quz: charapataqa k'uychichasqap suninnintam purichin

source: set xy
quz: xy nisqata churay

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
quz: charapataq xcor, ycor nisqaman churay; (0, 0) nisqaqa pantallap chawpinpi kachkan.

source: set heading
quz: mayman purinantam churay

source: sets the heading of the turtle (0 is towards the top of the screen.)
quz: charapap mayman rinanta churay (0 yupanaqa pantallap wichayninmanmi purichin)

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
quz: charapap kunan x t'urpisiq'inniyuqmi (yupanap huk bloquenrantin apaykachakunman)

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
quz: charapap kunan y t'urpisiq'inniyuqmi (yupanap huk bloquenrantin apaykachakunman)

source: holds current heading value of the turtle (can be used in place of a number block)
quz: charapap kunan purinanniyuqmi (yupanap huk bloquenrantin apaykachakunman)

source: Palette of pen commands
quz: Phurup kamachisqanpaq maru

source: pen
quz: phuru

source: fill screen
quz: pantallata hunt'achiy

source: fills the background with (color, shade)
quz: ukhuntaqa hunt'achiy (llimp'iwan, llantuwan ima)

source: set color
quz: llimp'ita akllay

source: sets color of the line drawn by the turtle
quz: charapap siq'ichasqa siq'ip llimp'intam churan

source: set shade
quz: llimp'ip k'anchayninta churay

source: sets shade of the line drawn by the turtle
quz: charapap siq'ichasqa siq'ip llimp'ip k'anchaynintam churan

source: set gray
quz: uqita churay

source: sets gray level of the line drawn by the turtle
quz: charapap siq'ichasqa siq'ip uqi llimp'inpa tupuntam churan
