Repository: Kiy4h/TortugadeMexico
Catalog: po/quz.po
Languages: quz

source: holds current pen color (can be used in place of a number block)
quz: phurup kunan llimp'inyuqmi (yupanap bloquenrantim hap'ikullanman)

source: holds current pen shade
quz: phurup kunan llimp'i k'anchayniyuqmi

source: holds current gray level (can be used in place of a number block)
quz: uqip kunan kaq tupunyuqmi (yupanap bloquenrantim hap'ikullanman)

source: pen up
quz: phuruta huqariy

source: Turtle will not draw when moved.
quz: Charapa kuyunqa hinaqa manam siq'ichanqachu.

source: pen down
quz: phuruta urayachiy

source: Turtle will draw when moved.
quz: Charapa purispaqa siq'ichanqam.

source: pen down?
quz: ¿uray phuru?

source: returns True if pen is down
quz: Phuru urayachisqa kaptinqa Chiqanmi nispan kutichin

source: set pen size
quz: sayayninta akllay

source: sets size of the line drawn by the turtle
quz: rakhuchu kanqa utaq ñañuchu kanqa charapap siq'isqanqa chayta churan

source: start fill
quz: hunt'achiyta qallariy

source: starts filled polygon (used with end fill block)
quz: polígono nisqatam hunt'achiyta qallariy (bloquep hunt'achinawanmi rurakuchkan)

source: end fill
quz: huntach'iyta tukuy

source: completes filled polygon (used with start fill block)
quz: hunt'asqa polígono nisqata hunt'achiy (bloquepa hunt'achinawanmi rurakuchkan)

source: pen size
quz: sayaynin

source: holds current pen size (can be used in place of a number block)
quz: phurup hunan sayayninniyuqmi (yupanap bloquenmantaqa hap'ikullanmanmi)

source: Palette of pen colors
quz: Phurup llimp'iymarun

source: colors
quz: llimp'ikuna

source: red
quz: puka

source: orange
quz: q'illmu

source: yellow
quz: q'illu

source: green
quz: q'umir

source: cyan
quz: qhusi

source: blue
quz: anqas

source: purple
quz: kulli

source: white
quz: yuraq

source: black
quz: yana

source: Palette of numeric operators
quz: Yupanakunawan llamk'anapaq maru

source: numbers
quz: yupanakuna

source: plus
quz: yapapay

source: adds two alphanumeric inputs
quz: iskay qillqa-yupanakunatam yapapan

source: minus
quz: qichuq

source: subtracts bottom numeric input from top numeric input
quz: wichaypi kaq yupanap yaykuyninmanta uraypi kaq yupanap yaykuyninta pisiyachin

source: multiply
quz: mirachiy

source: multiplies two numeric inputs
quz: iskay yupana yaykuytam mirachin

source: divide
quz: rakiy

source: divides top numeric input (numerator) by bottom numeric input (denominator)
quz: wichay yupanap yaykuyninta (patmasqa) uray yupanap yaykuyninta rikuspa (patmaq) rakin

source: identity
quz: pim kay

source: identity operator used for extending blocks
quz: bloquekuna mast'arichinapaq apaykachasqa pim kaypa kamaqnin

source: modular (remainder) operator
quz: mod apaykachaq (puchuq)

source: square root
quz: raíz cuadrada nisqa

source: calculates square root
quz: raíz cuadrada nisqata tariy

source: random
quz: mayqin kaqpas

source: returns random number between minimum (top) and maximum (bottom) values
quz: wichaypi kaq ñupu chaniwanmanta uraypi kaq piwi chaniwanmanta mayqin yupatapas kutichin

source: number
quz: yupana

source: used as numeric input in mathematic operators
quz: matemática kamaqkunapi yupanap yaykuyninhina apayakachasqa

source: greater than
quz: kuraq

source: logical greater-than operator
quz: chaymantaqa kuraq nisqa lógico kamaq

source: less than
quz: sullk'an

source: logical less-than operator
quz: chaymantaqa sullk'a-kaq nisqa lógico kamaq

source: equal
quz: kikillan

source: logical equal-to operator
quz: kikin-kaq nisqa lógico kamaq

source: not
quz: mana

source: logical NOT operator
quz: kay lógico kamaqqa MANA nisqam

source: and
quz: hinallataq

source: logical AND operator
quz: HINALLATAQ nisqa lógico kamaq

source: or
quz: utaq

source: logical OR operator
quz: UTAQ nisqa lógico kamaq

source: flow
quz: purina

source: wait
quz: suyay

source: pauses program execution a specified number of seconds
quz: segundokuna churasqa yupariymanta programap rurakuyninta suyachin

source: forever
quz: wiñaypaq

source: loops forever
quz: wiñaypaq waktawan kutichiy

source: repeat
quz: waktawan kutichiy

source: loops specified number of times
quz: hayk'a kutitaq chaypa yupaynintam kutichin

source: if
quz: sichus

source: then
quz: hinataq

source: if then
quz: sichus hinataq

source: if-then operator that uses boolean operators from Numbers palette
quz: Yupana marup operadores lógicos nisqan apaykachaq sichus-hinataq nisqa kamaq

source: else
quz: manachayqa

source: if then else
quz: sichus hinataq manachayqa

source: if-then-else operator that uses boolean operators from Numbers palette
quz: Yupanakuna llamk'anamanta ari-chayna-kaptinqa mana-chauqayupana marup operadores lógicos nisqan apaykachaq sichus-hintaq-manachayqa nisqa kamaq

source: horizontal space
quz: kinray k'iti

source: jogs stack right
quz: pañamanmi tawqataqa suchuchin

source: vertical space
quz: qhata k'iti

source: jogs stack down
quz: uraymanmi tawqataqa suchuchiy

source: stop action
quz: rurayta sayachiy

source: stops current action
quz: kunan kaq ruraytam sayachin

source: Palette of variable blocks
quz: variables nisqap bloquenkunap marun

source: blocks
quz: bloquekuna

source: connects action to toolbar run buttons
quz: llamk'anakunapaq barrap ruraq ñit'inanman ruraytam t’inkichin

source: top of nameable action stack
quz: sutichayhina ruraypa tawqanpa wichaynin

source: store in box 1
quz: kahun 1 nisqapi waqaychay

source: stores numeric value in Variable 1
quz: variable 1 nisqapi yupanap chanintaqa waqaychay

source: store in box 2
quz: kahun 2 nisqapi waqaychay

source: stores numeric value in Variable 2
quz: variable 2 nisqapi yupanap chanintaqa waqaychay

source: box 1
quz: kahun 1

source: Variable 1 (numeric value)
quz: Variable 1 nisqa (yupanap chanin)

source: box 2
quz: kahun 2

source: Variable 2 (numeric value)
quz: Variable 2 nisqa (yupanap chanin)

source: box
quz: kahun

source: action 1
quz: ruray 1

source: top of Action 1 stack
quz: ñawpa kaqmi Ruray 1 nisqap tawqanpi

source: action 2
quz: ruray 2

source: top of Action 2 stack
quz: ñawpa kaqmi Ruray 2 nisqap tawqanpi

source: invokes Action 1 stack
quz: kay Ruray 1 nisqa tawqatam waqyan

source: invokes Action 2 stack
quz: kay Ruray 2 nisqa tawqatam waqyan

source: invokes named action stack and returns value
quz: huk rurayta sutinmantam waqyan hinallataq hun chanintam kutichin

source: return
quz: kutiy

source: returns a value
quz: huk chanintam kutichin

source: permanently deletes items in trash
quz: q'upanapi imaymana kaqtaqa sapakutim qasichin

source: restore all
quz: llapanta llanllarichiy

source: restore all blocks from trash
quz: q'upanapi ima bloque nisqakuna kaqtaqa llipinta llanllarichin

source: clear all
quz: llapanta pichay

source: move all blocks to trash
quz: llapan bloque nisqakunataqa q'upanaman wikch'un
